<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <base data-ice="baseUrl" href="../../../">
  <title data-ice="title">src/encode/CP932.js | mojijs</title>
  <link type="text/css" rel="stylesheet" href="css/style.css">
  <link type="text/css" rel="stylesheet" href="css/prettify-tomorrow.css">
  <script src="script/prettify/prettify.js"></script>
  <script src="script/manual.js"></script>
<meta name="description" content="To convert or to analyze the character data of the Japanese."><meta property="twitter:card" content="summary"><meta property="twitter:title" content="mojijs"><meta property="twitter:description" content="To convert or to analyze the character data of the Japanese."></head>
<body class="layout-container" data-ice="rootContainer">

<header>
  <a href="./">Home</a>
  
  <a href="identifiers.html">Reference</a>
  <a href="source.html">Source</a>
  
  <div class="search-box">
  <span>
    <img src="./image/search.png">
    <span class="search-input-edge"></span><input class="search-input"><span class="search-input-edge"></span>
  </span>
    <ul class="search-result"></ul>
  </div>
<a style="position:relative; top:3px;" href="https://github.com/natade-jp/MojiJS.git"><img width="20px" src="./image/github.png"></a></header>

<nav class="navigation" data-ice="nav"><div>
  <ul>
    
  <li data-ice="doc"><span data-ice="kind" class="kind-class">C</span><span data-ice="name"><span><a href="class/src/MojiJS.js~MojiJS.html">MojiJS</a></span></span></li>
<li data-ice="doc"><a data-ice="dirPath" class="nav-dir-path" href="identifiers.html#encode">encode</a><span data-ice="kind" class="kind-typedef">T</span><span data-ice="name"><span><a href="typedef/index.html#static-typedef-MenKuTen">MenKuTen</a></span></span></li>
<li data-ice="doc"><a data-ice="dirPath" class="nav-dir-path" href="identifiers.html#tools">tools</a><span data-ice="kind" class="kind-typedef">T</span><span data-ice="name"><span><a href="typedef/index.html#static-typedef-MojiData">MojiData</a></span></span></li>
<li data-ice="doc"><span data-ice="kind" class="kind-typedef">T</span><span data-ice="name"><span><a href="typedef/index.html#static-typedef-MojiEncodeData">MojiEncodeData</a></span></span></li>
<li data-ice="doc"><span data-ice="kind" class="kind-typedef">T</span><span data-ice="name"><span><a href="typedef/index.html#static-typedef-MojiTypeData">MojiTypeData</a></span></span></li>
</ul>
</div>
</nav>

<div class="content" data-ice="content"><h1 data-ice="title">src/encode/CP932.js</h1>
<pre class="source-code line-number raw-source-code"><code class="prettyprint linenums" data-ice="content">&#xFEFF;/**
 * The script is part of MojiJS.
 * 
 * AUTHOR:
 *  natade (http://twitter.com/natadea)
 * 
 * LICENSE:
 *  The MIT license https://opensource.org/licenses/MIT
 */

import Unicode from &quot;./Unicode.js&quot;;
import SJIS from &quot;./SJIS.js&quot;;

/**
 * CP932, Windows-31J &#x306E;&#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x4F5C;&#x6210;&#x7528;&#x30AF;&#x30E9;&#x30B9;
 * @ignore
 */
class CP932MAP {

	/**
	 * &#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x3092;&#x521D;&#x671F;&#x5316;
	 */
	static init() {
		if(CP932MAP.is_initmap) {
			return;
		}
		CP932MAP.is_initmap = true;
		
		/**
		 * @returns {Object&lt;number, number&gt;}
		 */
		const getCp932ToUnicodeMap = function() {

			/**
			 * 1&#x30D0;&#x30A4;&#x30C8;&#x306E;&#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;
			 * 
			 * 
			 * &#x53C2;&#x8003;&#xFF1A;WideCharToMultiByte
			 * &#x30E1;&#x30E2;&#xFF1A;&#x4ECA;&#x56DE;&#x306F;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x304C;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x6587;&#x732E;&#x3082;&#x53C2;&#x8003;&#x306B;&#x306A;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;
			 * ftp://www.unicode.org/Public/MAPPINGS/OBSOLETE/EASTASIA/JIS/JIS0208.TXT
			 * @type {Object&lt;number, number&gt;}
			 */
			let cp932_to_unicode_map = {
				0x01: 0x01, 0x02: 0x02, 0x03: 0x03, 0x04: 0x04, 0x05: 0x05, 0x06: 0x06, 0x07: 0x07, 0x08: 0x08,
				0x09: 0x09, 0x0a: 0x0a, 0x0b: 0x0b, 0x0c: 0x0c, 0x0d: 0x0d, 0x0e: 0x0e, 0x0f: 0x0f, 0x10: 0x10,
				0x11: 0x11, 0x12: 0x12, 0x13: 0x13, 0x14: 0x14, 0x15: 0x15, 0x16: 0x16, 0x17: 0x17, 0x18: 0x18,
				0x19: 0x19, 0x1a: 0x1a, 0x1b: 0x1b, 0x1c: 0x1c, 0x1d: 0x1d, 0x1e: 0x1e, 0x1f: 0x1f, 0x20: 0x20,
				0x21: 0x21, 0x22: 0x22, 0x23: 0x23, 0x24: 0x24, 0x25: 0x25, 0x26: 0x26, 0x27: 0x27, 0x28: 0x28,
				0x29: 0x29, 0x2a: 0x2a, 0x2b: 0x2b, 0x2c: 0x2c, 0x2d: 0x2d, 0x2e: 0x2e, 0x2f: 0x2f, 0x30: 0x30,
				0x31: 0x31, 0x32: 0x32, 0x33: 0x33, 0x34: 0x34, 0x35: 0x35, 0x36: 0x36, 0x37: 0x37, 0x38: 0x38,
				0x39: 0x39, 0x3a: 0x3a, 0x3b: 0x3b, 0x3c: 0x3c, 0x3d: 0x3d, 0x3e: 0x3e, 0x3f: 0x3f, 0x40: 0x40,
				0x41: 0x41, 0x42: 0x42, 0x43: 0x43, 0x44: 0x44, 0x45: 0x45, 0x46: 0x46, 0x47: 0x47, 0x48: 0x48,
				0x49: 0x49, 0x4a: 0x4a, 0x4b: 0x4b, 0x4c: 0x4c, 0x4d: 0x4d, 0x4e: 0x4e, 0x4f: 0x4f, 0x50: 0x50,
				0x51: 0x51, 0x52: 0x52, 0x53: 0x53, 0x54: 0x54, 0x55: 0x55, 0x56: 0x56, 0x57: 0x57, 0x58: 0x58,
				0x59: 0x59, 0x5a: 0x5a, 0x5b: 0x5b, 0x5c: 0x5c, 0x5d: 0x5d, 0x5e: 0x5e, 0x5f: 0x5f, 0x60: 0x60,
				0x61: 0x61, 0x62: 0x62, 0x63: 0x63, 0x64: 0x64, 0x65: 0x65, 0x66: 0x66, 0x67: 0x67, 0x68: 0x68,
				0x69: 0x69, 0x6a: 0x6a, 0x6b: 0x6b, 0x6c: 0x6c, 0x6d: 0x6d, 0x6e: 0x6e, 0x6f: 0x6f, 0x70: 0x70,
				0x71: 0x71, 0x72: 0x72, 0x73: 0x73, 0x74: 0x74, 0x75: 0x75, 0x76: 0x76, 0x77: 0x77, 0x78: 0x78,
				0x79: 0x79, 0x7a: 0x7a, 0x7b: 0x7b, 0x7c: 0x7c, 0x7d: 0x7d, 0x7e: 0x7e, 0x7f: 0x7f, 0x80: 0x80,
				0xa0: 0xf8f0, 0xa1: 0xff61, 0xa2: 0xff62, 0xa3: 0xff63, 0xa4: 0xff64, 0xa5: 0xff65, 0xa6: 0xff66, 0xa7: 0xff67,
				0xa8: 0xff68, 0xa9: 0xff69, 0xaa: 0xff6a, 0xab: 0xff6b, 0xac: 0xff6c, 0xad: 0xff6d, 0xae: 0xff6e, 0xaf: 0xff6f,
				0xb0: 0xff70, 0xb1: 0xff71, 0xb2: 0xff72, 0xb3: 0xff73, 0xb4: 0xff74, 0xb5: 0xff75, 0xb6: 0xff76, 0xb7: 0xff77,
				0xb8: 0xff78, 0xb9: 0xff79, 0xba: 0xff7a, 0xbb: 0xff7b, 0xbc: 0xff7c, 0xbd: 0xff7d, 0xbe: 0xff7e, 0xbf: 0xff7f,
				0xc0: 0xff80, 0xc1: 0xff81, 0xc2: 0xff82, 0xc3: 0xff83, 0xc4: 0xff84, 0xc5: 0xff85, 0xc6: 0xff86, 0xc7: 0xff87,
				0xc8: 0xff88, 0xc9: 0xff89, 0xca: 0xff8a, 0xcb: 0xff8b, 0xcc: 0xff8c, 0xcd: 0xff8d, 0xce: 0xff8e, 0xcf: 0xff8f,
				0xd0: 0xff90, 0xd1: 0xff91, 0xd2: 0xff92, 0xd3: 0xff93, 0xd4: 0xff94, 0xd5: 0xff95, 0xd6: 0xff96, 0xd7: 0xff97,
				0xd8: 0xff98, 0xd9: 0xff99, 0xda: 0xff9a, 0xdb: 0xff9b, 0xdc: 0xff9c, 0xdd: 0xff9d, 0xde: 0xff9e, 0xdf: 0xff9f,
				0xfd: 0xf8f1, 0xfe: 0xf8f2, 0xff: 0xf8f3
			};

			/**
			 * 2&#x30D0;&#x30A4;&#x30C8;&#x6587;&#x5B57;&#xFF08;0x8140-0xffff&#xFF09;&#x306E;&#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x4F5C;&#x6210;&#x7528;&#x306E;&#x6587;&#x5B57;&#x5217;
			 * @type {string}
			 */
			let map = &quot;&#x3000;&#x3001;&#x3002;&#xFF0C;&#xFF0E;&#x30FB;&#xFF1A;&#xFF1B;&#xFF1F;&#xFF01;&#x309B;&#x309C;&#xB4;&#xFF40;&#xA8;&#xFF3E;&#xFFE3;&#xFF3F;&#x30FD;&#x30FE;&#x309D;&#x309E;&#x3003;&#x4EDD;&#x3005;&#x3006;&#x3007;&#x30FC;&#x2015;&#x2010;&#xFF0F;&#xFF3C;&#xFF5E;&#x2225;&#xFF5C;&#x2026;&#x2025;&#x2018;&#x2019;&#x201C;&#x201D;&#xFF08;&#xFF09;&#x3014;&#x3015;&#xFF3B;&#xFF3D;&#xFF5B;&#xFF5D;&#x3008;&#x3009;&#x300A;&#x300B;&#x300C;&#x300D;&#x300E;&#x300F;&#x3010;&#x3011;&#xFF0B;&#xFF0D;&#xB1;&#xD7;1&#xF7;&#xFF1D;&#x2260;&#xFF1C;&#xFF1E;&#x2266;&#x2267;&#x221E;&#x2234;&#x2642;&#x2640;&#xB0;&#x2032;&#x2033;&#x2103;&#xFFE5;&#xFF04;&#xFFE0;&#xFFE1;&#xFF05;&#xFF03;&#xFF06;&#xFF0A;&#xFF20;&#xA7;&#x2606;&#x2605;&#x25CB;&#x25CF;&#x25CE;&#x25C7;&#x25C6;&#x25A1;&#x25A0;&#x25B3;&#x25B2;&#x25BD;&#x25BC;&#x203B;&#x3012;&#x2192;&#x2190;&#x2191;&#x2193;&#x3013;11&#x2208;&#x220B;&#x2286;&#x2287;&#x2282;&#x2283;&#x222A;&#x2229;8&#x2227;&#x2228;&#xFFE2;&#x21D2;&#x21D4;&#x2200;&#x2203;11&#x2220;&#x22A5;&#x2312;&#x2202;&#x2207;&#x2261;&#x2252;&#x226A;&#x226B;&#x221A;&#x223D;&#x221D;&#x2235;&#x222B;&#x222C;7&#x212B;&#x2030;&#x266F;&#x266D;&#x266A;&#x2020;&#x2021;&#xB6;4&#x25EF;82&quot;;
			map += &quot;&#xFF10;&#xFF11;&#xFF12;&#xFF13;&#xFF14;&#xFF15;&#xFF16;&#xFF17;&#xFF18;&#xFF19;7&#xFF21;&#xFF22;&#xFF23;&#xFF24;&#xFF25;&#xFF26;&#xFF27;&#xFF28;&#xFF29;&#xFF2A;&#xFF2B;&#xFF2C;&#xFF2D;&#xFF2E;&#xFF2F;&#xFF30;&#xFF31;&#xFF32;&#xFF33;&#xFF34;&#xFF35;&#xFF36;&#xFF37;&#xFF38;&#xFF39;&#xFF3A;7&#xFF41;&#xFF42;&#xFF43;&#xFF44;&#xFF45;&#xFF46;&#xFF47;&#xFF48;&#xFF49;&#xFF4A;&#xFF4B;&#xFF4C;&#xFF4D;&#xFF4E;&#xFF4F;&#xFF50;&#xFF51;&#xFF52;&#xFF53;&#xFF54;&#xFF55;&#xFF56;&#xFF57;&#xFF58;&#xFF59;&#xFF5A;4&#x3041;&#x3042;&#x3043;&#x3044;&#x3045;&#x3046;&#x3047;&#x3048;&#x3049;&#x304A;&#x304B;&#x304C;&#x304D;&#x304E;&#x304F;&#x3050;&#x3051;&#x3052;&#x3053;&#x3054;&#x3055;&#x3056;&#x3057;&#x3058;&#x3059;&#x305A;&#x305B;&#x305C;&#x305D;&#x305E;&#x305F;&#x3060;&#x3061;&#x3062;&#x3063;&#x3064;&#x3065;&#x3066;&#x3067;&#x3068;&#x3069;&#x306A;&#x306B;&#x306C;&#x306D;&#x306E;&#x306F;&#x3070;&#x3071;&#x3072;&#x3073;&#x3074;&#x3075;&#x3076;&#x3077;&#x3078;&#x3079;&#x307A;&#x307B;&#x307C;&#x307D;&#x307E;&#x307F;&#x3080;&#x3081;&#x3082;&#x3083;&#x3084;&#x3085;&#x3086;&#x3087;&#x3088;&#x3089;&#x308A;&#x308B;&#x308C;&#x308D;&#x308E;&#x308F;&#x3090;&#x3091;&#x3092;&#x3093;78&quot;;
			map += &quot;&#x30A1;&#x30A2;&#x30A3;&#x30A4;&#x30A5;&#x30A6;&#x30A7;&#x30A8;&#x30A9;&#x30AA;&#x30AB;&#x30AC;&#x30AD;&#x30AE;&#x30AF;&#x30B0;&#x30B1;&#x30B2;&#x30B3;&#x30B4;&#x30B5;&#x30B6;&#x30B7;&#x30B8;&#x30B9;&#x30BA;&#x30BB;&#x30BC;&#x30BD;&#x30BE;&#x30BF;&#x30C0;&#x30C1;&#x30C2;&#x30C3;&#x30C4;&#x30C5;&#x30C6;&#x30C7;&#x30C8;&#x30C9;&#x30CA;&#x30CB;&#x30CC;&#x30CD;&#x30CE;&#x30CF;&#x30D0;&#x30D1;&#x30D2;&#x30D3;&#x30D4;&#x30D5;&#x30D6;&#x30D7;&#x30D8;&#x30D9;&#x30DA;&#x30DB;&#x30DC;&#x30DD;&#x30DE;&#x30DF;1&#x30E0;&#x30E1;&#x30E2;&#x30E3;&#x30E4;&#x30E5;&#x30E6;&#x30E7;&#x30E8;&#x30E9;&#x30EA;&#x30EB;&#x30EC;&#x30ED;&#x30EE;&#x30EF;&#x30F0;&#x30F1;&#x30F2;&#x30F3;&#x30F4;&#x30F5;&#x30F6;8&#x391;&#x392;&#x393;&#x394;&#x395;&#x396;&#x397;&#x398;&#x399;&#x39A;&#x39B;&#x39C;&#x39D;&#x39E;&#x39F;&#x3A0;&#x3A1;&#x3A3;&#x3A4;&#x3A5;&#x3A6;&#x3A7;&#x3A8;&#x3A9;8&#x3B1;&#x3B2;&#x3B3;&#x3B4;&#x3B5;&#x3B6;&#x3B7;&#x3B8;&#x3B9;&#x3BA;&#x3BB;&#x3BC;&#x3BD;&#x3BE;&#x3BF;&#x3C0;&#x3C1;&#x3C3;&#x3C4;&#x3C5;&#x3C6;&#x3C7;&#x3C8;&#x3C9;105&#x410;&#x411;&#x412;&#x413;&#x414;&#x415;&#x401;&#x416;&#x417;&#x418;&#x419;&#x41A;&#x41B;&#x41C;&#x41D;&#x41E;&#x41F;&#x420;&#x421;&#x422;&#x423;&#x424;&#x425;&#x426;&#x427;&#x428;&#x429;&#x42A;&#x42B;&#x42C;&#x42D;&#x42E;&#x42F;15&#x430;&#x431;&#x432;&#x433;&#x434;&#x435;&#x451;&#x436;&#x437;&#x438;&#x439;&#x43A;&#x43B;&#x43C;&#x43D;1&#x43E;&#x43F;&#x440;&#x441;&#x442;&#x443;&#x444;&#x445;&#x446;&#x447;&#x448;&#x449;&#x44A;&#x44B;&#x44C;&#x44D;&#x44E;&#x44F;13&#x2500;&#x2502;&#x250C;&#x2510;&#x2518;&#x2514;&#x251C;&#x252C;&#x2524;&#x2534;&#x253C;&#x2501;&#x2503;&#x250F;&#x2513;&#x251B;&#x2517;&#x2523;&#x2533;&#x252B;&#x253B;&#x254B;&#x2520;&#x252F;&#x2528;&#x2537;&#x253F;&#x251D;&#x2530;&#x2525;&#x2538;&#x2542;641&quot;;
			map += &quot;&#x2460;&#x2461;&#x2462;&#x2463;&#x2464;&#x2465;&#x2466;&#x2467;&#x2468;&#x2469;&#x246A;&#x246B;&#x246C;&#x246D;&#x246E;&#x246F;&#x2470;&#x2471;&#x2472;&#x2473;&#x2160;&#x2161;&#x2162;&#x2163;&#x2164;&#x2165;&#x2166;&#x2167;&#x2168;&#x2169;1&#x3349;&#x3314;&#x3322;&#x334D;&#x3318;&#x3327;&#x3303;&#x3336;&#x3351;&#x3357;&#x330D;&#x3326;&#x3323;&#x332B;&#x334A;&#x333B;&#x339C;&#x339D;&#x339E;&#x338E;&#x338F;&#x33C4;&#x33A1;8&#x337B;1&#x301D;&#x301F;&#x2116;&#x33CD;&#x2121;&#x32A4;&#x32A5;&#x32A6;&#x32A7;&#x32A8;&#x3231;&#x3232;&#x3239;&#x337E;&#x337D;&#x337C;&#x2252;&#x2261;&#x222B;&#x222E;&#x2211;&#x221A;&#x22A5;&#x2220;&#x221F;&#x22BF;&#x2235;&#x2229;&#x222A;258&quot;;
			map += &quot;&#x4E9C;&#x5516;&#x5A03;&#x963F;&#x54C0;&#x611B;&#x6328;&#x59F6;&#x9022;&#x8475;&#x831C;&#x7A50;&#x60AA;&#x63E1;&#x6E25;&#x65ED;&#x8466;&#x82A6;&#x9BF5;&#x6893;&#x5727;&#x65A1;&#x6271;&#x5B9B;&#x59D0;&#x867B;&#x98F4;&#x7D62;&#x7DBE;&#x9B8E;&#x6216;&#x7C9F;&#x88B7;&#x5B89;&#x5EB5;&#x6309;&#x6697;&#x6848;&#x95C7;&#x978D;&#x674F;&#x4EE5;&#x4F0A;&#x4F4D;&#x4F9D;&#x5049;&#x56F2;&#x5937;&#x59D4;&#x5A01;&#x5C09;&#x60DF;&#x610F;&#x6170;&#x6613;&#x6905;&#x70BA;&#x754F;&#x7570;&#x79FB;&#x7DAD;&#x7DEF;&#x80C3;&#x840E;&#x8863;&#x8B02;&#x9055;&#x907A;&#x533B;&#x4E95;&#x4EA5;&#x57DF;&#x80B2;&#x90C1;&#x78EF;&#x4E00;&#x58F1;&#x6EA2;&#x9038;&#x7A32;&#x8328;&#x828B;&#x9C2F;&#x5141;&#x5370;&#x54BD;&#x54E1;&#x56E0;&#x59FB;&#x5F15;&#x98F2;&#x6DEB;&#x80E4;&#x852D;67&quot;;
			map += &quot;&#x9662;&#x9670;&#x96A0;&#x97FB;&#x540B;&#x53F3;&#x5B87;&#x70CF;&#x7FBD;&#x8FC2;&#x96E8;&#x536F;&#x9D5C;&#x7ABA;&#x4E11;&#x7893;&#x81FC;&#x6E26;&#x5618;&#x5504;&#x6B1D;&#x851A;&#x9C3B;&#x59E5;&#x53A9;&#x6D66;&#x74DC;&#x958F;&#x5642;&#x4E91;&#x904B;&#x96F2;&#x834F;&#x990C;&#x53E1;&#x55B6;&#x5B30;&#x5F71;&#x6620;&#x66F3;&#x6804;&#x6C38;&#x6CF3;&#x6D29;&#x745B;&#x76C8;&#x7A4E;&#x9834;&#x82F1;&#x885B;&#x8A60;&#x92ED;&#x6DB2;&#x75AB;&#x76CA;&#x99C5;&#x60A6;&#x8B01;&#x8D8A;&#x95B2;&#x698E;&#x53AD;&#x5186;1&#x5712;&#x5830;&#x5944;&#x5BB4;&#x5EF6;&#x6028;&#x63A9;&#x63F4;&#x6CBF;&#x6F14;&#x708E;&#x7114;&#x7159;&#x71D5;&#x733F;&#x7E01;&#x8276;&#x82D1;&#x8597;&#x9060;&#x925B;&#x9D1B;&#x5869;&#x65BC;&#x6C5A;&#x7525;&#x51F9;&#x592E;&#x5965;&#x5F80;&#x5FDC;&#x62BC;&#x65FA;&#x6A2A;&#x6B27;&#x6BB4;&#x738B;&#x7FC1;&#x8956;&#x9D2C;&#x9D0E;&#x9EC4;&#x5CA1;&#x6C96;&#x837B;&#x5104;&#x5C4B;&#x61B6;&#x81C6;&#x6876;&#x7261;&#x4E59;&#x4FFA;&#x5378;&#x6069;&#x6E29;&#x7A4F;&#x97F3;&#x4E0B;&#x5316;&#x4EEE;&#x4F55;&#x4F3D;&#x4FA1;&#x4F73;&#x52A0;&#x53EF;&#x5609;&#x590F;&#x5AC1;&#x5BB6;&#x5BE1;&#x79D1;&#x6687;&#x679C;&#x67B6;&#x6B4C;&#x6CB3;&#x706B;&#x73C2;&#x798D;&#x79BE;&#x7A3C;&#x7B87;&#x82B1;&#x82DB;&#x8304;&#x8377;&#x83EF;&#x83D3;&#x8766;&#x8AB2;&#x5629;&#x8CA8;&#x8FE6;&#x904E;&#x971E;&#x868A;&#x4FC4;&#x5CE8;&#x6211;&#x7259;&#x753B;&#x81E5;&#x82BD;&#x86FE;&#x8CC0;&#x96C5;&#x9913;&#x99D5;&#x4ECB;&#x4F1A;&#x89E3;&#x56DE;&#x584A;&#x58CA;&#x5EFB;&#x5FEB;&#x602A;&#x6094;&#x6062;&#x61D0;&#x6212;&#x62D0;&#x6539;67&quot;;
			map += &quot;&#x9B41;&#x6666;&#x68B0;&#x6D77;&#x7070;&#x754C;&#x7686;&#x7D75;&#x82A5;&#x87F9;&#x958B;&#x968E;&#x8C9D;&#x51F1;&#x52BE;&#x5916;&#x54B3;&#x5BB3;&#x5D16;&#x6168;&#x6982;&#x6DAF;&#x788D;&#x84CB;&#x8857;&#x8A72;&#x93A7;&#x9AB8;&#x6D6C;&#x99A8;&#x86D9;&#x57A3;&#x67FF;&#x86CE;&#x920E;&#x5283;&#x5687;&#x5404;&#x5ED3;&#x62E1;&#x64B9;&#x683C;&#x6838;&#x6BBB;&#x7372;&#x78BA;&#x7A6B;&#x899A;&#x89D2;&#x8D6B;&#x8F03;&#x90ED;&#x95A3;&#x9694;&#x9769;&#x5B66;&#x5CB3;&#x697D;&#x984D;&#x984E;&#x639B;&#x7B20;&#x6A2B;1&#x6A7F;&#x68B6;&#x9C0D;&#x6F5F;&#x5272;&#x559D;&#x6070;&#x62EC;&#x6D3B;&#x6E07;&#x6ED1;&#x845B;&#x8910;&#x8F44;&#x4E14;&#x9C39;&#x53F6;&#x691B;&#x6A3A;&#x9784;&#x682A;&#x515C;&#x7AC3;&#x84B2;&#x91DC;&#x938C;&#x565B;&#x9D28;&#x6822;&#x8305;&#x8431;&#x7CA5;&#x5208;&#x82C5;&#x74E6;&#x4E7E;&#x4F83;&#x51A0;&#x5BD2;&#x520A;&#x52D8;&#x52E7;&#x5DFB;&#x559A;&#x582A;&#x59E6;&#x5B8C;&#x5B98;&#x5BDB;&#x5E72;&#x5E79;&#x60A3;&#x611F;&#x6163;&#x61BE;&#x63DB;&#x6562;&#x67D1;&#x6853;&#x68FA;&#x6B3E;&#x6B53;&#x6C57;&#x6F22;&#x6F97;&#x6F45;&#x74B0;&#x7518;&#x76E3;&#x770B;&#x7AFF;&#x7BA1;&#x7C21;&#x7DE9;&#x7F36;&#x7FF0;&#x809D;&#x8266;&#x839E;&#x89B3;&#x8ACC;&#x8CAB;&#x9084;&#x9451;&#x9593;&#x9591;&#x95A2;&#x9665;&#x97D3;&#x9928;&#x8218;&#x4E38;&#x542B;&#x5CB8;&#x5DCC;&#x73A9;&#x764C;&#x773C;&#x5CA9;&#x7FEB;&#x8D0B;&#x96C1;&#x9811;&#x9854;&#x9858;&#x4F01;&#x4F0E;&#x5371;&#x559C;&#x5668;&#x57FA;&#x5947;&#x5B09;&#x5BC4;&#x5C90;&#x5E0C;&#x5E7E;&#x5FCC;&#x63EE;&#x673A;&#x65D7;&#x65E2;&#x671F;&#x68CB;&#x68C4;67&quot;;
			map += &quot;&#x6A5F;&#x5E30;&#x6BC5;&#x6C17;&#x6C7D;&#x757F;&#x7948;&#x5B63;&#x7A00;&#x7D00;&#x5FBD;&#x898F;&#x8A18;&#x8CB4;&#x8D77;&#x8ECC;&#x8F1D;&#x98E2;&#x9A0E;&#x9B3C;&#x4E80;&#x507D;&#x5100;&#x5993;&#x5B9C;&#x622F;&#x6280;&#x64EC;&#x6B3A;&#x72A0;&#x7591;&#x7947;&#x7FA9;&#x87FB;&#x8ABC;&#x8B70;&#x63AC;&#x83CA;&#x97A0;&#x5409;&#x5403;&#x55AB;&#x6854;&#x6A58;&#x8A70;&#x7827;&#x6775;&#x9ECD;&#x5374;&#x5BA2;&#x811A;&#x8650;&#x9006;&#x4E18;&#x4E45;&#x4EC7;&#x4F11;&#x53CA;&#x5438;&#x5BAE;&#x5F13;&#x6025;&#x6551;1&#x673D;&#x6C42;&#x6C72;&#x6CE3;&#x7078;&#x7403;&#x7A76;&#x7AAE;&#x7B08;&#x7D1A;&#x7CFE;&#x7D66;&#x65E7;&#x725B;&#x53BB;&#x5C45;&#x5DE8;&#x62D2;&#x62E0;&#x6319;&#x6E20;&#x865A;&#x8A31;&#x8DDD;&#x92F8;&#x6F01;&#x79A6;&#x9B5A;&#x4EA8;&#x4EAB;&#x4EAC;&#x4F9B;&#x4FA0;&#x50D1;&#x5147;&#x7AF6;&#x5171;&#x51F6;&#x5354;&#x5321;&#x537F;&#x53EB;&#x55AC;&#x5883;&#x5CE1;&#x5F37;&#x5F4A;&#x602F;&#x6050;&#x606D;&#x631F;&#x6559;&#x6A4B;&#x6CC1;&#x72C2;&#x72ED;&#x77EF;&#x80F8;&#x8105;&#x8208;&#x854E;&#x90F7;&#x93E1;&#x97FF;&#x9957;&#x9A5A;&#x4EF0;&#x51DD;&#x5C2D;&#x6681;&#x696D;&#x5C40;&#x66F2;&#x6975;&#x7389;&#x6850;&#x7C81;&#x50C5;&#x52E4;&#x5747;&#x5DFE;&#x9326;&#x65A4;&#x6B23;&#x6B3D;&#x7434;&#x7981;&#x79BD;&#x7B4B;&#x7DCA;&#x82B9;&#x83CC;&#x887F;&#x895F;&#x8B39;&#x8FD1;&#x91D1;&#x541F;&#x9280;&#x4E5D;&#x5036;&#x53E5;&#x533A;&#x72D7;&#x7396;&#x77E9;&#x82E6;&#x8EAF;&#x99C6;&#x99C8;&#x99D2;&#x5177;&#x611A;&#x865E;&#x55B0;&#x7A7A;&#x5076;&#x5BD3;&#x9047;&#x9685;&#x4E32;&#x6ADB;&#x91E7;&#x5C51;&#x5C48;67&quot;;
			map += &quot;&#x6398;&#x7A9F;&#x6C93;&#x9774;&#x8F61;&#x7AAA;&#x718A;&#x9688;&#x7C82;&#x6817;&#x7E70;&#x6851;&#x936C;&#x52F2;&#x541B;&#x85AB;&#x8A13;&#x7FA4;&#x8ECD;&#x90E1;&#x5366;&#x8888;&#x7941;&#x4FC2;&#x50BE;&#x5211;&#x5144;&#x5553;&#x572D;&#x73EA;&#x578B;&#x5951;&#x5F62;&#x5F84;&#x6075;&#x6176;&#x6167;&#x61A9;&#x63B2;&#x643A;&#x656C;&#x666F;&#x6842;&#x6E13;&#x7566;&#x7A3D;&#x7CFB;&#x7D4C;&#x7D99;&#x7E4B;&#x7F6B;&#x830E;&#x834A;&#x86CD;&#x8A08;&#x8A63;&#x8B66;&#x8EFD;&#x981A;&#x9D8F;&#x82B8;&#x8FCE;&#x9BE8;1&#x5287;&#x621F;&#x6483;&#x6FC0;&#x9699;&#x6841;&#x5091;&#x6B20;&#x6C7A;&#x6F54;&#x7A74;&#x7D50;&#x8840;&#x8A23;&#x6708;&#x4EF6;&#x5039;&#x5026;&#x5065;&#x517C;&#x5238;&#x5263;&#x55A7;&#x570F;&#x5805;&#x5ACC;&#x5EFA;&#x61B2;&#x61F8;&#x62F3;&#x6372;&#x691C;&#x6A29;&#x727D;&#x72AC;&#x732E;&#x7814;&#x786F;&#x7D79;&#x770C;&#x80A9;&#x898B;&#x8B19;&#x8CE2;&#x8ED2;&#x9063;&#x9375;&#x967A;&#x9855;&#x9A13;&#x9E78;&#x5143;&#x539F;&#x53B3;&#x5E7B;&#x5F26;&#x6E1B;&#x6E90;&#x7384;&#x73FE;&#x7D43;&#x8237;&#x8A00;&#x8AFA;&#x9650;&#x4E4E;&#x500B;&#x53E4;&#x547C;&#x56FA;&#x59D1;&#x5B64;&#x5DF1;&#x5EAB;&#x5F27;&#x6238;&#x6545;&#x67AF;&#x6E56;&#x72D0;&#x7CCA;&#x88B4;&#x80A1;&#x80E1;&#x83F0;&#x864E;&#x8A87;&#x8DE8;&#x9237;&#x96C7;&#x9867;&#x9F13;&#x4E94;&#x4E92;&#x4F0D;&#x5348;&#x5449;&#x543E;&#x5A2F;&#x5F8C;&#x5FA1;&#x609F;&#x68A7;&#x6A8E;&#x745A;&#x7881;&#x8A9E;&#x8AA4;&#x8B77;&#x9190;&#x4E5E;&#x9BC9;&#x4EA4;&#x4F7C;&#x4FAF;&#x5019;&#x5016;&#x5149;&#x516C;&#x529F;&#x52B9;&#x52FE;&#x539A;&#x53E3;&#x5411;67&quot;;
			map += &quot;&#x540E;&#x5589;&#x5751;&#x57A2;&#x597D;&#x5B54;&#x5B5D;&#x5B8F;&#x5DE5;&#x5DE7;&#x5DF7;&#x5E78;&#x5E83;&#x5E9A;&#x5EB7;&#x5F18;&#x6052;&#x614C;&#x6297;&#x62D8;&#x63A7;&#x653B;&#x6602;&#x6643;&#x66F4;&#x676D;&#x6821;&#x6897;&#x69CB;&#x6C5F;&#x6D2A;&#x6D69;&#x6E2F;&#x6E9D;&#x7532;&#x7687;&#x786C;&#x7A3F;&#x7CE0;&#x7D05;&#x7D18;&#x7D5E;&#x7DB1;&#x8015;&#x8003;&#x80AF;&#x80B1;&#x8154;&#x818F;&#x822A;&#x8352;&#x884C;&#x8861;&#x8B1B;&#x8CA2;&#x8CFC;&#x90CA;&#x9175;&#x9271;&#x783F;&#x92FC;&#x95A4;&#x964D;1&#x9805;&#x9999;&#x9AD8;&#x9D3B;&#x525B;&#x52AB;&#x53F7;&#x5408;&#x58D5;&#x62F7;&#x6FE0;&#x8C6A;&#x8F5F;&#x9EB9;&#x514B;&#x523B;&#x544A;&#x56FD;&#x7A40;&#x9177;&#x9D60;&#x9ED2;&#x7344;&#x6F09;&#x8170;&#x7511;&#x5FFD;&#x60DA;&#x9AA8;&#x72DB;&#x8FBC;&#x6B64;&#x9803;&#x4ECA;&#x56F0;&#x5764;&#x58BE;&#x5A5A;&#x6068;&#x61C7;&#x660F;&#x6606;&#x6839;&#x68B1;&#x6DF7;&#x75D5;&#x7D3A;&#x826E;&#x9B42;&#x4E9B;&#x4F50;&#x53C9;&#x5506;&#x5D6F;&#x5DE6;&#x5DEE;&#x67FB;&#x6C99;&#x7473;&#x7802;&#x8A50;&#x9396;&#x88DF;&#x5750;&#x5EA7;&#x632B;&#x50B5;&#x50AC;&#x518D;&#x6700;&#x54C9;&#x585E;&#x59BB;&#x5BB0;&#x5F69;&#x624D;&#x63A1;&#x683D;&#x6B73;&#x6E08;&#x707D;&#x91C7;&#x7280;&#x7815;&#x7826;&#x796D;&#x658E;&#x7D30;&#x83DC;&#x88C1;&#x8F09;&#x969B;&#x5264;&#x5728;&#x6750;&#x7F6A;&#x8CA1;&#x51B4;&#x5742;&#x962A;&#x583A;&#x698A;&#x80B4;&#x54B2;&#x5D0E;&#x57FC;&#x7895;&#x9DFA;&#x4F5C;&#x524A;&#x548B;&#x643E;&#x6628;&#x6714;&#x67F5;&#x7A84;&#x7B56;&#x7D22;&#x932F;&#x685C;&#x9BAD;&#x7B39;&#x5319;&#x518A;&#x5237;67&quot;;
			map += &quot;&#x5BDF;&#x62F6;&#x64AE;&#x64E6;&#x672D;&#x6BBA;&#x85A9;&#x96D1;&#x7690;&#x9BD6;&#x634C;&#x9306;&#x9BAB;&#x76BF;&#x6652;&#x4E09;&#x5098;&#x53C2;&#x5C71;&#x60E8;&#x6492;&#x6563;&#x685F;&#x71E6;&#x73CA;&#x7523;&#x7B97;&#x7E82;&#x8695;&#x8B83;&#x8CDB;&#x9178;&#x9910;&#x65AC;&#x66AB;&#x6B8B;&#x4ED5;&#x4ED4;&#x4F3A;&#x4F7F;&#x523A;&#x53F8;&#x53F2;&#x55E3;&#x56DB;&#x58EB;&#x59CB;&#x59C9;&#x59FF;&#x5B50;&#x5C4D;&#x5E02;&#x5E2B;&#x5FD7;&#x601D;&#x6307;&#x652F;&#x5B5C;&#x65AF;&#x65BD;&#x65E8;&#x679D;&#x6B62;1&#x6B7B;&#x6C0F;&#x7345;&#x7949;&#x79C1;&#x7CF8;&#x7D19;&#x7D2B;&#x80A2;&#x8102;&#x81F3;&#x8996;&#x8A5E;&#x8A69;&#x8A66;&#x8A8C;&#x8AEE;&#x8CC7;&#x8CDC;&#x96CC;&#x98FC;&#x6B6F;&#x4E8B;&#x4F3C;&#x4F8D;&#x5150;&#x5B57;&#x5BFA;&#x6148;&#x6301;&#x6642;&#x6B21;&#x6ECB;&#x6CBB;&#x723E;&#x74BD;&#x75D4;&#x78C1;&#x793A;&#x800C;&#x8033;&#x81EA;&#x8494;&#x8F9E;&#x6C50;&#x9E7F;&#x5F0F;&#x8B58;&#x9D2B;&#x7AFA;&#x8EF8;&#x5B8D;&#x96EB;&#x4E03;&#x53F1;&#x57F7;&#x5931;&#x5AC9;&#x5BA4;&#x6089;&#x6E7F;&#x6F06;&#x75BE;&#x8CEA;&#x5B9F;&#x8500;&#x7BE0;&#x5072;&#x67F4;&#x829D;&#x5C61;&#x854A;&#x7E1E;&#x820E;&#x5199;&#x5C04;&#x6368;&#x8D66;&#x659C;&#x716E;&#x793E;&#x7D17;&#x8005;&#x8B1D;&#x8ECA;&#x906E;&#x86C7;&#x90AA;&#x501F;&#x52FA;&#x5C3A;&#x6753;&#x707C;&#x7235;&#x914C;&#x91C8;&#x932B;&#x82E5;&#x5BC2;&#x5F31;&#x60F9;&#x4E3B;&#x53D6;&#x5B88;&#x624B;&#x6731;&#x6B8A;&#x72E9;&#x73E0;&#x7A2E;&#x816B;&#x8DA3;&#x9152;&#x9996;&#x5112;&#x53D7;&#x546A;&#x5BFF;&#x6388;&#x6A39;&#x7DAC;&#x9700;&#x56DA;&#x53CE;&#x5468;67&quot;;
			map += &quot;&#x5B97;&#x5C31;&#x5DDE;&#x4FEE;&#x6101;&#x62FE;&#x6D32;&#x79C0;&#x79CB;&#x7D42;&#x7E4D;&#x7FD2;&#x81ED;&#x821F;&#x8490;&#x8846;&#x8972;&#x8B90;&#x8E74;&#x8F2F;&#x9031;&#x914B;&#x916C;&#x96C6;&#x919C;&#x4EC0;&#x4F4F;&#x5145;&#x5341;&#x5F93;&#x620E;&#x67D4;&#x6C41;&#x6E0B;&#x7363;&#x7E26;&#x91CD;&#x9283;&#x53D4;&#x5919;&#x5BBF;&#x6DD1;&#x795D;&#x7E2E;&#x7C9B;&#x587E;&#x719F;&#x51FA;&#x8853;&#x8FF0;&#x4FCA;&#x5CFB;&#x6625;&#x77AC;&#x7AE3;&#x821C;&#x99FF;&#x51C6;&#x5FAA;&#x65EC;&#x696F;&#x6B89;&#x6DF3;1&#x6E96;&#x6F64;&#x76FE;&#x7D14;&#x5DE1;&#x9075;&#x9187;&#x9806;&#x51E6;&#x521D;&#x6240;&#x6691;&#x66D9;&#x6E1A;&#x5EB6;&#x7DD2;&#x7F72;&#x66F8;&#x85AF;&#x85F7;&#x8AF8;&#x52A9;&#x53D9;&#x5973;&#x5E8F;&#x5F90;&#x6055;&#x92E4;&#x9664;&#x50B7;&#x511F;&#x52DD;&#x5320;&#x5347;&#x53EC;&#x54E8;&#x5546;&#x5531;&#x5617;&#x5968;&#x59BE;&#x5A3C;&#x5BB5;&#x5C06;&#x5C0F;&#x5C11;&#x5C1A;&#x5E84;&#x5E8A;&#x5EE0;&#x5F70;&#x627F;&#x6284;&#x62DB;&#x638C;&#x6377;&#x6607;&#x660C;&#x662D;&#x6676;&#x677E;&#x68A2;&#x6A1F;&#x6A35;&#x6CBC;&#x6D88;&#x6E09;&#x6E58;&#x713C;&#x7126;&#x7167;&#x75C7;&#x7701;&#x785D;&#x7901;&#x7965;&#x79F0;&#x7AE0;&#x7B11;&#x7CA7;&#x7D39;&#x8096;&#x83D6;&#x848B;&#x8549;&#x885D;&#x88F3;&#x8A1F;&#x8A3C;&#x8A54;&#x8A73;&#x8C61;&#x8CDE;&#x91A4;&#x9266;&#x937E;&#x9418;&#x969C;&#x9798;&#x4E0A;&#x4E08;&#x4E1E;&#x4E57;&#x5197;&#x5270;&#x57CE;&#x5834;&#x58CC;&#x5B22;&#x5E38;&#x60C5;&#x64FE;&#x6761;&#x6756;&#x6D44;&#x72B6;&#x7573;&#x7A63;&#x84B8;&#x8B72;&#x91B8;&#x9320;&#x5631;&#x57F4;&#x98FE;67&quot;;
			map += &quot;&#x62ED;&#x690D;&#x6B96;&#x71ED;&#x7E54;&#x8077;&#x8272;&#x89E6;&#x98DF;&#x8755;&#x8FB1;&#x5C3B;&#x4F38;&#x4FE1;&#x4FB5;&#x5507;&#x5A20;&#x5BDD;&#x5BE9;&#x5FC3;&#x614E;&#x632F;&#x65B0;&#x664B;&#x68EE;&#x699B;&#x6D78;&#x6DF1;&#x7533;&#x75B9;&#x771F;&#x795E;&#x79E6;&#x7D33;&#x81E3;&#x82AF;&#x85AA;&#x89AA;&#x8A3A;&#x8EAB;&#x8F9B;&#x9032;&#x91DD;&#x9707;&#x4EBA;&#x4EC1;&#x5203;&#x5875;&#x58EC;&#x5C0B;&#x751A;&#x5C3D;&#x814E;&#x8A0A;&#x8FC5;&#x9663;&#x976D;&#x7B25;&#x8ACF;&#x9808;&#x9162;&#x56F3;&#x53A8;1&#x9017;&#x5439;&#x5782;&#x5E25;&#x63A8;&#x6C34;&#x708A;&#x7761;&#x7C8B;&#x7FE0;&#x8870;&#x9042;&#x9154;&#x9310;&#x9318;&#x968F;&#x745E;&#x9AC4;&#x5D07;&#x5D69;&#x6570;&#x67A2;&#x8DA8;&#x96DB;&#x636E;&#x6749;&#x6919;&#x83C5;&#x9817;&#x96C0;&#x88FE;&#x6F84;&#x647A;&#x5BF8;&#x4E16;&#x702C;&#x755D;&#x662F;&#x51C4;&#x5236;&#x52E2;&#x59D3;&#x5F81;&#x6027;&#x6210;&#x653F;&#x6574;&#x661F;&#x6674;&#x68F2;&#x6816;&#x6B63;&#x6E05;&#x7272;&#x751F;&#x76DB;&#x7CBE;&#x8056;&#x58F0;&#x88FD;&#x897F;&#x8AA0;&#x8A93;&#x8ACB;&#x901D;&#x9192;&#x9752;&#x9759;&#x6589;&#x7A0E;&#x8106;&#x96BB;&#x5E2D;&#x60DC;&#x621A;&#x65A5;&#x6614;&#x6790;&#x77F3;&#x7A4D;&#x7C4D;&#x7E3E;&#x810A;&#x8CAC;&#x8D64;&#x8DE1;&#x8E5F;&#x78A9;&#x5207;&#x62D9;&#x63A5;&#x6442;&#x6298;&#x8A2D;&#x7A83;&#x7BC0;&#x8AAC;&#x96EA;&#x7D76;&#x820C;&#x8749;&#x4ED9;&#x5148;&#x5343;&#x5360;&#x5BA3;&#x5C02;&#x5C16;&#x5DDD;&#x6226;&#x6247;&#x64B0;&#x6813;&#x6834;&#x6CC9;&#x6D45;&#x6D17;&#x67D3;&#x6F5C;&#x714E;&#x717D;&#x65CB;&#x7A7F;&#x7BAD;&#x7DDA;67&quot;;
			map += &quot;&#x7E4A;&#x7FA8;&#x817A;&#x821B;&#x8239;&#x85A6;&#x8A6E;&#x8CCE;&#x8DF5;&#x9078;&#x9077;&#x92AD;&#x9291;&#x9583;&#x9BAE;&#x524D;&#x5584;&#x6F38;&#x7136;&#x5168;&#x7985;&#x7E55;&#x81B3;&#x7CCE;&#x564C;&#x5851;&#x5CA8;&#x63AA;&#x66FE;&#x66FD;&#x695A;&#x72D9;&#x758F;&#x758E;&#x790E;&#x7956;&#x79DF;&#x7C97;&#x7D20;&#x7D44;&#x8607;&#x8A34;&#x963B;&#x9061;&#x9F20;&#x50E7;&#x5275;&#x53CC;&#x53E2;&#x5009;&#x55AA;&#x58EE;&#x594F;&#x723D;&#x5B8B;&#x5C64;&#x531D;&#x60E3;&#x60F3;&#x635C;&#x6383;&#x633F;&#x63BB;1&#x64CD;&#x65E9;&#x66F9;&#x5DE3;&#x69CD;&#x69FD;&#x6F15;&#x71E5;&#x4E89;&#x75E9;&#x76F8;&#x7A93;&#x7CDF;&#x7DCF;&#x7D9C;&#x8061;&#x8349;&#x8358;&#x846C;&#x84BC;&#x85FB;&#x88C5;&#x8D70;&#x9001;&#x906D;&#x9397;&#x971C;&#x9A12;&#x50CF;&#x5897;&#x618E;&#x81D3;&#x8535;&#x8D08;&#x9020;&#x4FC3;&#x5074;&#x5247;&#x5373;&#x606F;&#x6349;&#x675F;&#x6E2C;&#x8DB3;&#x901F;&#x4FD7;&#x5C5E;&#x8CCA;&#x65CF;&#x7D9A;&#x5352;&#x8896;&#x5176;&#x63C3;&#x5B58;&#x5B6B;&#x5C0A;&#x640D;&#x6751;&#x905C;&#x4ED6;&#x591A;&#x592A;&#x6C70;&#x8A51;&#x553E;&#x5815;&#x59A5;&#x60F0;&#x6253;&#x67C1;&#x8235;&#x6955;&#x9640;&#x99C4;&#x9A28;&#x4F53;&#x5806;&#x5BFE;&#x8010;&#x5CB1;&#x5E2F;&#x5F85;&#x6020;&#x614B;&#x6234;&#x66FF;&#x6CF0;&#x6EDE;&#x80CE;&#x817F;&#x82D4;&#x888B;&#x8CB8;&#x9000;&#x902E;&#x968A;&#x9EDB;&#x9BDB;&#x4EE3;&#x53F0;&#x5927;&#x7B2C;&#x918D;&#x984C;&#x9DF9;&#x6EDD;&#x7027;&#x5353;&#x5544;&#x5B85;&#x6258;&#x629E;&#x62D3;&#x6CA2;&#x6FEF;&#x7422;&#x8A17;&#x9438;&#x6FC1;&#x8AFE;&#x8338;&#x51E7;&#x86F8;&#x53EA;67&quot;;
			map += &quot;&#x53E9;&#x4F46;&#x9054;&#x8FB0;&#x596A;&#x8131;&#x5DFD;&#x7AEA;&#x8FBF;&#x68DA;&#x8C37;&#x72F8;&#x9C48;&#x6A3D;&#x8AB0;&#x4E39;&#x5358;&#x5606;&#x5766;&#x62C5;&#x63A2;&#x65E6;&#x6B4E;&#x6DE1;&#x6E5B;&#x70AD;&#x77ED;&#x7AEF;&#x7BAA;&#x7DBB;&#x803D;&#x80C6;&#x86CB;&#x8A95;&#x935B;&#x56E3;&#x58C7;&#x5F3E;&#x65AD;&#x6696;&#x6A80;&#x6BB5;&#x7537;&#x8AC7;&#x5024;&#x77E5;&#x5730;&#x5F1B;&#x6065;&#x667A;&#x6C60;&#x75F4;&#x7A1A;&#x7F6E;&#x81F4;&#x8718;&#x9045;&#x99B3;&#x7BC9;&#x755C;&#x7AF9;&#x7B51;&#x84C4;1&#x9010;&#x79E9;&#x7A92;&#x8336;&#x5AE1;&#x7740;&#x4E2D;&#x4EF2;&#x5B99;&#x5FE0;&#x62BD;&#x663C;&#x67F1;&#x6CE8;&#x866B;&#x8877;&#x8A3B;&#x914E;&#x92F3;&#x99D0;&#x6A17;&#x7026;&#x732A;&#x82E7;&#x8457;&#x8CAF;&#x4E01;&#x5146;&#x51CB;&#x558B;&#x5BF5;&#x5E16;&#x5E33;&#x5E81;&#x5F14;&#x5F35;&#x5F6B;&#x5FB4;&#x61F2;&#x6311;&#x66A2;&#x671D;&#x6F6E;&#x7252;&#x753A;&#x773A;&#x8074;&#x8139;&#x8178;&#x8776;&#x8ABF;&#x8ADC;&#x8D85;&#x8DF3;&#x929A;&#x9577;&#x9802;&#x9CE5;&#x52C5;&#x6357;&#x76F4;&#x6715;&#x6C88;&#x73CD;&#x8CC3;&#x93AE;&#x9673;&#x6D25;&#x589C;&#x690E;&#x69CC;&#x8FFD;&#x939A;&#x75DB;&#x901A;&#x585A;&#x6802;&#x63B4;&#x69FB;&#x4F43;&#x6F2C;&#x67D8;&#x8FBB;&#x8526;&#x7DB4;&#x9354;&#x693F;&#x6F70;&#x576A;&#x58F7;&#x5B2C;&#x7D2C;&#x722A;&#x540A;&#x91E3;&#x9DB4;&#x4EAD;&#x4F4E;&#x505C;&#x5075;&#x5243;&#x8C9E;&#x5448;&#x5824;&#x5B9A;&#x5E1D;&#x5E95;&#x5EAD;&#x5EF7;&#x5F1F;&#x608C;&#x62B5;&#x633A;&#x63D0;&#x68AF;&#x6C40;&#x7887;&#x798E;&#x7A0B;&#x7DE0;&#x8247;&#x8A02;&#x8AE6;&#x8E44;&#x9013;67&quot;;
			map += &quot;&#x90B8;&#x912D;&#x91D8;&#x9F0E;&#x6CE5;&#x6458;&#x64E2;&#x6575;&#x6EF4;&#x7684;&#x7B1B;&#x9069;&#x93D1;&#x6EBA;&#x54F2;&#x5FB9;&#x64A4;&#x8F4D;&#x8FED;&#x9244;&#x5178;&#x586B;&#x5929;&#x5C55;&#x5E97;&#x6DFB;&#x7E8F;&#x751C;&#x8CBC;&#x8EE2;&#x985B;&#x70B9;&#x4F1D;&#x6BBF;&#x6FB1;&#x7530;&#x96FB;&#x514E;&#x5410;&#x5835;&#x5857;&#x59AC;&#x5C60;&#x5F92;&#x6597;&#x675C;&#x6E21;&#x767B;&#x83DF;&#x8CED;&#x9014;&#x90FD;&#x934D;&#x7825;&#x783A;&#x52AA;&#x5EA6;&#x571F;&#x5974;&#x6012;&#x5012;&#x515A;&#x51AC;1&#x51CD;&#x5200;&#x5510;&#x5854;&#x5858;&#x5957;&#x5B95;&#x5CF6;&#x5D8B;&#x60BC;&#x6295;&#x642D;&#x6771;&#x6843;&#x68BC;&#x68DF;&#x76D7;&#x6DD8;&#x6E6F;&#x6D9B;&#x706F;&#x71C8;&#x5F53;&#x75D8;&#x7977;&#x7B49;&#x7B54;&#x7B52;&#x7CD6;&#x7D71;&#x5230;&#x8463;&#x8569;&#x85E4;&#x8A0E;&#x8B04;&#x8C46;&#x8E0F;&#x9003;&#x900F;&#x9419;&#x9676;&#x982D;&#x9A30;&#x95D8;&#x50CD;&#x52D5;&#x540C;&#x5802;&#x5C0E;&#x61A7;&#x649E;&#x6D1E;&#x77B3;&#x7AE5;&#x80F4;&#x8404;&#x9053;&#x9285;&#x5CE0;&#x9D07;&#x533F;&#x5F97;&#x5FB3;&#x6D9C;&#x7279;&#x7763;&#x79BF;&#x7BE4;&#x6BD2;&#x72EC;&#x8AAD;&#x6803;&#x6A61;&#x51F8;&#x7A81;&#x6934;&#x5C4A;&#x9CF6;&#x82EB;&#x5BC5;&#x9149;&#x701E;&#x5678;&#x5C6F;&#x60C7;&#x6566;&#x6C8C;&#x8C5A;&#x9041;&#x9813;&#x5451;&#x66C7;&#x920D;&#x5948;&#x90A3;&#x5185;&#x4E4D;&#x51EA;&#x8599;&#x8B0E;&#x7058;&#x637A;&#x934B;&#x6962;&#x99B4;&#x7E04;&#x7577;&#x5357;&#x6960;&#x8EDF;&#x96E3;&#x6C5D;&#x4E8C;&#x5C3C;&#x5F10;&#x8FE9;&#x5302;&#x8CD1;&#x8089;&#x8679;&#x5EFF;&#x65E5;&#x4E73;&#x5165;67&quot;;
			map += &quot;&#x5982;&#x5C3F;&#x97EE;&#x4EFB;&#x598A;&#x5FCD;&#x8A8D;&#x6FE1;&#x79B0;&#x7962;&#x5BE7;&#x8471;&#x732B;&#x71B1;&#x5E74;&#x5FF5;&#x637B;&#x649A;&#x71C3;&#x7C98;&#x4E43;&#x5EFC;&#x4E4B;&#x57DC;&#x56A2;&#x60A9;&#x6FC3;&#x7D0D;&#x80FD;&#x8133;&#x81BF;&#x8FB2;&#x8997;&#x86A4;&#x5DF4;&#x628A;&#x64AD;&#x8987;&#x6777;&#x6CE2;&#x6D3E;&#x7436;&#x7834;&#x5A46;&#x7F75;&#x82AD;&#x99AC;&#x4FF3;&#x5EC3;&#x62DD;&#x6392;&#x6557;&#x676F;&#x76C3;&#x724C;&#x80CC;&#x80BA;&#x8F29;&#x914D;&#x500D;&#x57F9;&#x5A92;&#x6885;1&#x6973;&#x7164;&#x72FD;&#x8CB7;&#x58F2;&#x8CE0;&#x966A;&#x9019;&#x877F;&#x79E4;&#x77E7;&#x8429;&#x4F2F;&#x5265;&#x535A;&#x62CD;&#x67CF;&#x6CCA;&#x767D;&#x7B94;&#x7C95;&#x8236;&#x8584;&#x8FEB;&#x66DD;&#x6F20;&#x7206;&#x7E1B;&#x83AB;&#x99C1;&#x9EA6;&#x51FD;&#x7BB1;&#x7872;&#x7BB8;&#x8087;&#x7B48;&#x6AE8;&#x5E61;&#x808C;&#x7551;&#x7560;&#x516B;&#x9262;&#x6E8C;&#x767A;&#x9197;&#x9AEA;&#x4F10;&#x7F70;&#x629C;&#x7B4F;&#x95A5;&#x9CE9;&#x567A;&#x5859;&#x86E4;&#x96BC;&#x4F34;&#x5224;&#x534A;&#x53CD;&#x53DB;&#x5E06;&#x642C;&#x6591;&#x677F;&#x6C3E;&#x6C4E;&#x7248;&#x72AF;&#x73ED;&#x7554;&#x7E41;&#x822C;&#x85E9;&#x8CA9;&#x7BC4;&#x91C6;&#x7169;&#x9812;&#x98EF;&#x633D;&#x6669;&#x756A;&#x76E4;&#x78D0;&#x8543;&#x86EE;&#x532A;&#x5351;&#x5426;&#x5983;&#x5E87;&#x5F7C;&#x60B2;&#x6249;&#x6279;&#x62AB;&#x6590;&#x6BD4;&#x6CCC;&#x75B2;&#x76AE;&#x7891;&#x79D8;&#x7DCB;&#x7F77;&#x80A5;&#x88AB;&#x8AB9;&#x8CBB;&#x907F;&#x975E;&#x98DB;&#x6A0B;&#x7C38;&#x5099;&#x5C3E;&#x5FAE;&#x6787;&#x6BD8;&#x7435;&#x7709;&#x7F8E;67&quot;;
			map += &quot;&#x9F3B;&#x67CA;&#x7A17;&#x5339;&#x758B;&#x9AED;&#x5F66;&#x819D;&#x83F1;&#x8098;&#x5F3C;&#x5FC5;&#x7562;&#x7B46;&#x903C;&#x6867;&#x59EB;&#x5A9B;&#x7D10;&#x767E;&#x8B2C;&#x4FF5;&#x5F6A;&#x6A19;&#x6C37;&#x6F02;&#x74E2;&#x7968;&#x8868;&#x8A55;&#x8C79;&#x5EDF;&#x63CF;&#x75C5;&#x79D2;&#x82D7;&#x9328;&#x92F2;&#x849C;&#x86ED;&#x9C2D;&#x54C1;&#x5F6C;&#x658C;&#x6D5C;&#x7015;&#x8CA7;&#x8CD3;&#x983B;&#x654F;&#x74F6;&#x4E0D;&#x4ED8;&#x57E0;&#x592B;&#x5A66;&#x5BCC;&#x51A8;&#x5E03;&#x5E9C;&#x6016;&#x6276;&#x6577;1&#x65A7;&#x666E;&#x6D6E;&#x7236;&#x7B26;&#x8150;&#x819A;&#x8299;&#x8B5C;&#x8CA0;&#x8CE6;&#x8D74;&#x961C;&#x9644;&#x4FAE;&#x64AB;&#x6B66;&#x821E;&#x8461;&#x856A;&#x90E8;&#x5C01;&#x6953;&#x98A8;&#x847A;&#x8557;&#x4F0F;&#x526F;&#x5FA9;&#x5E45;&#x670D;&#x798F;&#x8179;&#x8907;&#x8986;&#x6DF5;&#x5F17;&#x6255;&#x6CB8;&#x4ECF;&#x7269;&#x9B92;&#x5206;&#x543B;&#x5674;&#x58B3;&#x61A4;&#x626E;&#x711A;&#x596E;&#x7C89;&#x7CDE;&#x7D1B;&#x96F0;&#x6587;&#x805E;&#x4E19;&#x4F75;&#x5175;&#x5840;&#x5E63;&#x5E73;&#x5F0A;&#x67C4;&#x4E26;&#x853D;&#x9589;&#x965B;&#x7C73;&#x9801;&#x50FB;&#x58C1;&#x7656;&#x78A7;&#x5225;&#x77A5;&#x8511;&#x7B86;&#x504F;&#x5909;&#x7247;&#x7BC7;&#x7DE8;&#x8FBA;&#x8FD4;&#x904D;&#x4FBF;&#x52C9;&#x5A29;&#x5F01;&#x97AD;&#x4FDD;&#x8217;&#x92EA;&#x5703;&#x6355;&#x6B69;&#x752B;&#x88DC;&#x8F14;&#x7A42;&#x52DF;&#x5893;&#x6155;&#x620A;&#x66AE;&#x6BCD;&#x7C3F;&#x83E9;&#x5023;&#x4FF8;&#x5305;&#x5446;&#x5831;&#x5949;&#x5B9D;&#x5CF0;&#x5CEF;&#x5D29;&#x5E96;&#x62B1;&#x6367;&#x653E;&#x65B9;&#x670B;67&quot;;
			map += &quot;&#x6CD5;&#x6CE1;&#x70F9;&#x7832;&#x7E2B;&#x80DE;&#x82B3;&#x840C;&#x84EC;&#x8702;&#x8912;&#x8A2A;&#x8C4A;&#x90A6;&#x92D2;&#x98FD;&#x9CF3;&#x9D6C;&#x4E4F;&#x4EA1;&#x508D;&#x5256;&#x574A;&#x59A8;&#x5E3D;&#x5FD8;&#x5FD9;&#x623F;&#x66B4;&#x671B;&#x67D0;&#x68D2;&#x5192;&#x7D21;&#x80AA;&#x81A8;&#x8B00;&#x8C8C;&#x8CBF;&#x927E;&#x9632;&#x5420;&#x982C;&#x5317;&#x50D5;&#x535C;&#x58A8;&#x64B2;&#x6734;&#x7267;&#x7766;&#x7A46;&#x91E6;&#x52C3;&#x6CA1;&#x6B86;&#x5800;&#x5E4C;&#x5954;&#x672C;&#x7FFB;&#x51E1;&#x76C6;1&#x6469;&#x78E8;&#x9B54;&#x9EBB;&#x57CB;&#x59B9;&#x6627;&#x679A;&#x6BCE;&#x54E9;&#x69D9;&#x5E55;&#x819C;&#x6795;&#x9BAA;&#x67FE;&#x9C52;&#x685D;&#x4EA6;&#x4FE3;&#x53C8;&#x62B9;&#x672B;&#x6CAB;&#x8FC4;&#x4FAD;&#x7E6D;&#x9EBF;&#x4E07;&#x6162;&#x6E80;&#x6F2B;&#x8513;&#x5473;&#x672A;&#x9B45;&#x5DF3;&#x7B95;&#x5CAC;&#x5BC6;&#x871C;&#x6E4A;&#x84D1;&#x7A14;&#x8108;&#x5999;&#x7C8D;&#x6C11;&#x7720;&#x52D9;&#x5922;&#x7121;&#x725F;&#x77DB;&#x9727;&#x9D61;&#x690B;&#x5A7F;&#x5A18;&#x51A5;&#x540D;&#x547D;&#x660E;&#x76DF;&#x8FF7;&#x9298;&#x9CF4;&#x59EA;&#x725D;&#x6EC5;&#x514D;&#x68C9;&#x7DBF;&#x7DEC;&#x9762;&#x9EBA;&#x6478;&#x6A21;&#x8302;&#x5984;&#x5B5F;&#x6BDB;&#x731B;&#x76F2;&#x7DB2;&#x8017;&#x8499;&#x5132;&#x6728;&#x9ED9;&#x76EE;&#x6762;&#x52FF;&#x9905;&#x5C24;&#x623B;&#x7C7E;&#x8CB0;&#x554F;&#x60B6;&#x7D0B;&#x9580;&#x5301;&#x4E5F;&#x51B6;&#x591C;&#x723A;&#x8036;&#x91CE;&#x5F25;&#x77E2;&#x5384;&#x5F79;&#x7D04;&#x85AC;&#x8A33;&#x8E8D;&#x9756;&#x67F3;&#x85AE;&#x9453;&#x6109;&#x6108;&#x6CB9;&#x7652;67&quot;;
			map += &quot;&#x8AED;&#x8F38;&#x552F;&#x4F51;&#x512A;&#x52C7;&#x53CB;&#x5BA5;&#x5E7D;&#x60A0;&#x6182;&#x63D6;&#x6709;&#x67DA;&#x6E67;&#x6D8C;&#x7336;&#x7337;&#x7531;&#x7950;&#x88D5;&#x8A98;&#x904A;&#x9091;&#x90F5;&#x96C4;&#x878D;&#x5915;&#x4E88;&#x4F59;&#x4E0E;&#x8A89;&#x8F3F;&#x9810;&#x50AD;&#x5E7C;&#x5996;&#x5BB9;&#x5EB8;&#x63DA;&#x63FA;&#x64C1;&#x66DC;&#x694A;&#x69D8;&#x6D0B;&#x6EB6;&#x7194;&#x7528;&#x7AAF;&#x7F8A;&#x8000;&#x8449;&#x84C9;&#x8981;&#x8B21;&#x8E0A;&#x9065;&#x967D;&#x990A;&#x617E;&#x6291;&#x6B32;1&#x6C83;&#x6D74;&#x7FCC;&#x7FFC;&#x6DC0;&#x7F85;&#x87BA;&#x88F8;&#x6765;&#x83B1;&#x983C;&#x96F7;&#x6D1B;&#x7D61;&#x843D;&#x916A;&#x4E71;&#x5375;&#x5D50;&#x6B04;&#x6FEB;&#x85CD;&#x862D;&#x89A7;&#x5229;&#x540F;&#x5C65;&#x674E;&#x68A8;&#x7406;&#x7483;&#x75E2;&#x88CF;&#x88E1;&#x91CC;&#x96E2;&#x9678;&#x5F8B;&#x7387;&#x7ACB;&#x844E;&#x63A0;&#x7565;&#x5289;&#x6D41;&#x6E9C;&#x7409;&#x7559;&#x786B;&#x7C92;&#x9686;&#x7ADC;&#x9F8D;&#x4FB6;&#x616E;&#x65C5;&#x865C;&#x4E86;&#x4EAE;&#x50DA;&#x4E21;&#x51CC;&#x5BEE;&#x6599;&#x6881;&#x6DBC;&#x731F;&#x7642;&#x77AD;&#x7A1C;&#x7CE7;&#x826F;&#x8AD2;&#x907C;&#x91CF;&#x9675;&#x9818;&#x529B;&#x7DD1;&#x502B;&#x5398;&#x6797;&#x6DCB;&#x71D0;&#x7433;&#x81E8;&#x8F2A;&#x96A3;&#x9C57;&#x9E9F;&#x7460;&#x5841;&#x6D99;&#x7D2F;&#x985E;&#x4EE4;&#x4F36;&#x4F8B;&#x51B7;&#x52B1;&#x5DBA;&#x601C;&#x73B2;&#x793C;&#x82D3;&#x9234;&#x96B7;&#x96F6;&#x970A;&#x9E97;&#x9F62;&#x66A6;&#x6B74;&#x5217;&#x52A3;&#x70C8;&#x88C2;&#x5EC9;&#x604B;&#x6190;&#x6F23;&#x7149;&#x7C3E;&#x7DF4;&#x806F;67&quot;;
			map += &quot;&#x84EE;&#x9023;&#x932C;&#x5442;&#x9B6F;&#x6AD3;&#x7089;&#x8CC2;&#x8DEF;&#x9732;&#x52B4;&#x5A41;&#x5ECA;&#x5F04;&#x6717;&#x697C;&#x6994;&#x6D6A;&#x6F0F;&#x7262;&#x72FC;&#x7BED;&#x8001;&#x807E;&#x874B;&#x90CE;&#x516D;&#x9E93;&#x7984;&#x808B;&#x9332;&#x8AD6;&#x502D;&#x548C;&#x8A71;&#x6B6A;&#x8CC4;&#x8107;&#x60D1;&#x67A0;&#x9DF2;&#x4E99;&#x4E98;&#x9C10;&#x8A6B;&#x85C1;&#x8568;&#x6900;&#x6E7E;&#x7897;&#x8155;44&#x5F0C;&#x4E10;&#x4E15;&#x4E2A;&#x4E31;&#x4E36;&#x4E3C;&#x4E3F;&#x4E42;&#x4E56;&#x4E58;&#x4E82;&#x4E85;&#x8C6B;&#x4E8A;&#x8212;&#x5F0D;&#x4E8E;&#x4E9E;&#x4E9F;&#x4EA0;&#x4EA2;&#x4EB0;&#x4EB3;&#x4EB6;&#x4ECE;&#x4ECD;&#x4EC4;&#x4EC6;&#x4EC2;&#x4ED7;&#x4EDE;&#x4EED;&#x4EDF;&#x4EF7;&#x4F09;&#x4F5A;&#x4F30;&#x4F5B;&#x4F5D;&#x4F57;&#x4F47;&#x4F76;&#x4F88;&#x4F8F;&#x4F98;&#x4F7B;&#x4F69;&#x4F70;&#x4F91;&#x4F6F;&#x4F86;&#x4F96;&#x5118;&#x4FD4;&#x4FDF;&#x4FCE;&#x4FD8;&#x4FDB;&#x4FD1;&#x4FDA;&#x4FD0;&#x4FE4;&#x4FE5;&#x501A;&#x5028;&#x5014;&#x502A;&#x5025;&#x5005;&#x4F1C;&#x4FF6;&#x5021;&#x5029;&#x502C;&#x4FFE;&#x4FEF;&#x5011;&#x5006;&#x5043;&#x5047;&#x6703;&#x5055;&#x5050;&#x5048;&#x505A;&#x5056;&#x506C;&#x5078;&#x5080;&#x509A;&#x5085;&#x50B4;&#x50B2;67&quot;;
			map += &quot;&#x50C9;&#x50CA;&#x50B3;&#x50C2;&#x50D6;&#x50DE;&#x50E5;&#x50ED;&#x50E3;&#x50EE;&#x50F9;&#x50F5;&#x5109;&#x5101;&#x5102;&#x5116;&#x5115;&#x5114;&#x511A;&#x5121;&#x513A;&#x5137;&#x513C;&#x513B;&#x513F;&#x5140;&#x5152;&#x514C;&#x5154;&#x5162;&#x7AF8;&#x5169;&#x516A;&#x516E;&#x5180;&#x5182;&#x56D8;&#x518C;&#x5189;&#x518F;&#x5191;&#x5193;&#x5195;&#x5196;&#x51A4;&#x51A6;&#x51A2;&#x51A9;&#x51AA;&#x51AB;&#x51B3;&#x51B1;&#x51B2;&#x51B0;&#x51B5;&#x51BD;&#x51C5;&#x51C9;&#x51DB;&#x51E0;&#x8655;&#x51E9;&#x51ED;1&#x51F0;&#x51F5;&#x51FE;&#x5204;&#x520B;&#x5214;&#x520E;&#x5227;&#x522A;&#x522E;&#x5233;&#x5239;&#x524F;&#x5244;&#x524B;&#x524C;&#x525E;&#x5254;&#x526A;&#x5274;&#x5269;&#x5273;&#x527F;&#x527D;&#x528D;&#x5294;&#x5292;&#x5271;&#x5288;&#x5291;&#x8FA8;&#x8FA7;&#x52AC;&#x52AD;&#x52BC;&#x52B5;&#x52C1;&#x52CD;&#x52D7;&#x52DE;&#x52E3;&#x52E6;&#x98ED;&#x52E0;&#x52F3;&#x52F5;&#x52F8;&#x52F9;&#x5306;&#x5308;&#x7538;&#x530D;&#x5310;&#x530F;&#x5315;&#x531A;&#x5323;&#x532F;&#x5331;&#x5333;&#x5338;&#x5340;&#x5346;&#x5345;&#x4E17;&#x5349;&#x534D;&#x51D6;&#x535E;&#x5369;&#x536E;&#x5918;&#x537B;&#x5377;&#x5382;&#x5396;&#x53A0;&#x53A6;&#x53A5;&#x53AE;&#x53B0;&#x53B6;&#x53C3;&#x7C12;&#x96D9;&#x53DF;&#x66FC;&#x71EE;&#x53EE;&#x53E8;&#x53ED;&#x53FA;&#x5401;&#x543D;&#x5440;&#x542C;&#x542D;&#x543C;&#x542E;&#x5436;&#x5429;&#x541D;&#x544E;&#x548F;&#x5475;&#x548E;&#x545F;&#x5471;&#x5477;&#x5470;&#x5492;&#x547B;&#x5480;&#x5476;&#x5484;&#x5490;&#x5486;&#x54C7;&#x54A2;&#x54B8;&#x54A5;&#x54AC;&#x54C4;&#x54C8;&#x54A8;67&quot;;
			map += &quot;&#x54AB;&#x54C2;&#x54A4;&#x54BE;&#x54BC;&#x54D8;&#x54E5;&#x54E6;&#x550F;&#x5514;&#x54FD;&#x54EE;&#x54ED;&#x54FA;&#x54E2;&#x5539;&#x5540;&#x5563;&#x554C;&#x552E;&#x555C;&#x5545;&#x5556;&#x5557;&#x5538;&#x5533;&#x555D;&#x5599;&#x5580;&#x54AF;&#x558A;&#x559F;&#x557B;&#x557E;&#x5598;&#x559E;&#x55AE;&#x557C;&#x5583;&#x55A9;&#x5587;&#x55A8;&#x55DA;&#x55C5;&#x55DF;&#x55C4;&#x55DC;&#x55E4;&#x55D4;&#x5614;&#x55F7;&#x5616;&#x55FE;&#x55FD;&#x561B;&#x55F9;&#x564E;&#x5650;&#x71DF;&#x5634;&#x5636;&#x5632;&#x5638;1&#x566B;&#x5664;&#x562F;&#x566C;&#x566A;&#x5686;&#x5680;&#x568A;&#x56A0;&#x5694;&#x568F;&#x56A5;&#x56AE;&#x56B6;&#x56B4;&#x56C2;&#x56BC;&#x56C1;&#x56C3;&#x56C0;&#x56C8;&#x56CE;&#x56D1;&#x56D3;&#x56D7;&#x56EE;&#x56F9;&#x5700;&#x56FF;&#x5704;&#x5709;&#x5708;&#x570B;&#x570D;&#x5713;&#x5718;&#x5716;&#x55C7;&#x571C;&#x5726;&#x5737;&#x5738;&#x574E;&#x573B;&#x5740;&#x574F;&#x5769;&#x57C0;&#x5788;&#x5761;&#x577F;&#x5789;&#x5793;&#x57A0;&#x57B3;&#x57A4;&#x57AA;&#x57B0;&#x57C3;&#x57C6;&#x57D4;&#x57D2;&#x57D3;&#x580A;&#x57D6;&#x57E3;&#x580B;&#x5819;&#x581D;&#x5872;&#x5821;&#x5862;&#x584B;&#x5870;&#x6BC0;&#x5852;&#x583D;&#x5879;&#x5885;&#x58B9;&#x589F;&#x58AB;&#x58BA;&#x58DE;&#x58BB;&#x58B8;&#x58AE;&#x58C5;&#x58D3;&#x58D1;&#x58D7;&#x58D9;&#x58D8;&#x58E5;&#x58DC;&#x58E4;&#x58DF;&#x58EF;&#x58FA;&#x58F9;&#x58FB;&#x58FC;&#x58FD;&#x5902;&#x590A;&#x5910;&#x591B;&#x68A6;&#x5925;&#x592C;&#x592D;&#x5932;&#x5938;&#x593E;&#x7AD2;&#x5955;&#x5950;&#x594E;&#x595A;&#x5958;&#x5962;&#x5960;&#x5967;&#x596C;&#x5969;67&quot;;
			map += &quot;&#x5978;&#x5981;&#x599D;&#x4F5E;&#x4FAB;&#x59A3;&#x59B2;&#x59C6;&#x59E8;&#x59DC;&#x598D;&#x59D9;&#x59DA;&#x5A25;&#x5A1F;&#x5A11;&#x5A1C;&#x5A09;&#x5A1A;&#x5A40;&#x5A6C;&#x5A49;&#x5A35;&#x5A36;&#x5A62;&#x5A6A;&#x5A9A;&#x5ABC;&#x5ABE;&#x5ACB;&#x5AC2;&#x5ABD;&#x5AE3;&#x5AD7;&#x5AE6;&#x5AE9;&#x5AD6;&#x5AFA;&#x5AFB;&#x5B0C;&#x5B0B;&#x5B16;&#x5B32;&#x5AD0;&#x5B2A;&#x5B36;&#x5B3E;&#x5B43;&#x5B45;&#x5B40;&#x5B51;&#x5B55;&#x5B5A;&#x5B5B;&#x5B65;&#x5B69;&#x5B70;&#x5B73;&#x5B75;&#x5B78;&#x6588;&#x5B7A;&#x5B80;1&#x5B83;&#x5BA6;&#x5BB8;&#x5BC3;&#x5BC7;&#x5BC9;&#x5BD4;&#x5BD0;&#x5BE4;&#x5BE6;&#x5BE2;&#x5BDE;&#x5BE5;&#x5BEB;&#x5BF0;&#x5BF6;&#x5BF3;&#x5C05;&#x5C07;&#x5C08;&#x5C0D;&#x5C13;&#x5C20;&#x5C22;&#x5C28;&#x5C38;&#x5C39;&#x5C41;&#x5C46;&#x5C4E;&#x5C53;&#x5C50;&#x5C4F;&#x5B71;&#x5C6C;&#x5C6E;&#x4E62;&#x5C76;&#x5C79;&#x5C8C;&#x5C91;&#x5C94;&#x599B;&#x5CAB;&#x5CBB;&#x5CB6;&#x5CBC;&#x5CB7;&#x5CC5;&#x5CBE;&#x5CC7;&#x5CD9;&#x5CE9;&#x5CFD;&#x5CFA;&#x5CED;&#x5D8C;&#x5CEA;&#x5D0B;&#x5D15;&#x5D17;&#x5D5C;&#x5D1F;&#x5D1B;&#x5D11;&#x5D14;&#x5D22;&#x5D1A;&#x5D19;&#x5D18;&#x5D4C;&#x5D52;&#x5D4E;&#x5D4B;&#x5D6C;&#x5D73;&#x5D76;&#x5D87;&#x5D84;&#x5D82;&#x5DA2;&#x5D9D;&#x5DAC;&#x5DAE;&#x5DBD;&#x5D90;&#x5DB7;&#x5DBC;&#x5DC9;&#x5DCD;&#x5DD3;&#x5DD2;&#x5DD6;&#x5DDB;&#x5DEB;&#x5DF2;&#x5DF5;&#x5E0B;&#x5E1A;&#x5E19;&#x5E11;&#x5E1B;&#x5E36;&#x5E37;&#x5E44;&#x5E43;&#x5E40;&#x5E4E;&#x5E57;&#x5E54;&#x5E5F;&#x5E62;&#x5E64;&#x5E47;&#x5E75;&#x5E76;&#x5E7A;&#x9EBC;&#x5E7F;&#x5EA0;&#x5EC1;&#x5EC2;&#x5EC8;&#x5ED0;&#x5ECF;67&quot;;
			map += &quot;&#x5ED6;&#x5EE3;&#x5EDD;&#x5EDA;&#x5EDB;&#x5EE2;&#x5EE1;&#x5EE8;&#x5EE9;&#x5EEC;&#x5EF1;&#x5EF3;&#x5EF0;&#x5EF4;&#x5EF8;&#x5EFE;&#x5F03;&#x5F09;&#x5F5D;&#x5F5C;&#x5F0B;&#x5F11;&#x5F16;&#x5F29;&#x5F2D;&#x5F38;&#x5F41;&#x5F48;&#x5F4C;&#x5F4E;&#x5F2F;&#x5F51;&#x5F56;&#x5F57;&#x5F59;&#x5F61;&#x5F6D;&#x5F73;&#x5F77;&#x5F83;&#x5F82;&#x5F7F;&#x5F8A;&#x5F88;&#x5F91;&#x5F87;&#x5F9E;&#x5F99;&#x5F98;&#x5FA0;&#x5FA8;&#x5FAD;&#x5FBC;&#x5FD6;&#x5FFB;&#x5FE4;&#x5FF8;&#x5FF1;&#x5FDD;&#x60B3;&#x5FFF;&#x6021;&#x6060;1&#x6019;&#x6010;&#x6029;&#x600E;&#x6031;&#x601B;&#x6015;&#x602B;&#x6026;&#x600F;&#x603A;&#x605A;&#x6041;&#x606A;&#x6077;&#x605F;&#x604A;&#x6046;&#x604D;&#x6063;&#x6043;&#x6064;&#x6042;&#x606C;&#x606B;&#x6059;&#x6081;&#x608D;&#x60E7;&#x6083;&#x609A;&#x6084;&#x609B;&#x6096;&#x6097;&#x6092;&#x60A7;&#x608B;&#x60E1;&#x60B8;&#x60E0;&#x60D3;&#x60B4;&#x5FF0;&#x60BD;&#x60C6;&#x60B5;&#x60D8;&#x614D;&#x6115;&#x6106;&#x60F6;&#x60F7;&#x6100;&#x60F4;&#x60FA;&#x6103;&#x6121;&#x60FB;&#x60F1;&#x610D;&#x610E;&#x6147;&#x613E;&#x6128;&#x6127;&#x614A;&#x613F;&#x613C;&#x612C;&#x6134;&#x613D;&#x6142;&#x6144;&#x6173;&#x6177;&#x6158;&#x6159;&#x615A;&#x616B;&#x6174;&#x616F;&#x6165;&#x6171;&#x615F;&#x615D;&#x6153;&#x6175;&#x6199;&#x6196;&#x6187;&#x61AC;&#x6194;&#x619A;&#x618A;&#x6191;&#x61AB;&#x61AE;&#x61CC;&#x61CA;&#x61C9;&#x61F7;&#x61C8;&#x61C3;&#x61C6;&#x61BA;&#x61CB;&#x7F79;&#x61CD;&#x61E6;&#x61E3;&#x61F6;&#x61FA;&#x61F4;&#x61FF;&#x61FD;&#x61FC;&#x61FE;&#x6200;&#x6208;&#x6209;&#x620D;&#x620C;&#x6214;&#x621B;67&quot;;
			map += &quot;&#x621E;&#x6221;&#x622A;&#x622E;&#x6230;&#x6232;&#x6233;&#x6241;&#x624E;&#x625E;&#x6263;&#x625B;&#x6260;&#x6268;&#x627C;&#x6282;&#x6289;&#x627E;&#x6292;&#x6293;&#x6296;&#x62D4;&#x6283;&#x6294;&#x62D7;&#x62D1;&#x62BB;&#x62CF;&#x62FF;&#x62C6;&#x64D4;&#x62C8;&#x62DC;&#x62CC;&#x62CA;&#x62C2;&#x62C7;&#x629B;&#x62C9;&#x630C;&#x62EE;&#x62F1;&#x6327;&#x6302;&#x6308;&#x62EF;&#x62F5;&#x6350;&#x633E;&#x634D;&#x641C;&#x634F;&#x6396;&#x638E;&#x6380;&#x63AB;&#x6376;&#x63A3;&#x638F;&#x6389;&#x639F;&#x63B5;&#x636B;1&#x6369;&#x63BE;&#x63E9;&#x63C0;&#x63C6;&#x63E3;&#x63C9;&#x63D2;&#x63F6;&#x63C4;&#x6416;&#x6434;&#x6406;&#x6413;&#x6426;&#x6436;&#x651D;&#x6417;&#x6428;&#x640F;&#x6467;&#x646F;&#x6476;&#x644E;&#x652A;&#x6495;&#x6493;&#x64A5;&#x64A9;&#x6488;&#x64BC;&#x64DA;&#x64D2;&#x64C5;&#x64C7;&#x64BB;&#x64D8;&#x64C2;&#x64F1;&#x64E7;&#x8209;&#x64E0;&#x64E1;&#x62AC;&#x64E3;&#x64EF;&#x652C;&#x64F6;&#x64F4;&#x64F2;&#x64FA;&#x6500;&#x64FD;&#x6518;&#x651C;&#x6505;&#x6524;&#x6523;&#x652B;&#x6534;&#x6535;&#x6537;&#x6536;&#x6538;&#x754B;&#x6548;&#x6556;&#x6555;&#x654D;&#x6558;&#x655E;&#x655D;&#x6572;&#x6578;&#x6582;&#x6583;&#x8B8A;&#x659B;&#x659F;&#x65AB;&#x65B7;&#x65C3;&#x65C6;&#x65C1;&#x65C4;&#x65CC;&#x65D2;&#x65DB;&#x65D9;&#x65E0;&#x65E1;&#x65F1;&#x6772;&#x660A;&#x6603;&#x65FB;&#x6773;&#x6635;&#x6636;&#x6634;&#x661C;&#x664F;&#x6644;&#x6649;&#x6641;&#x665E;&#x665D;&#x6664;&#x6667;&#x6668;&#x665F;&#x6662;&#x6670;&#x6683;&#x6688;&#x668E;&#x6689;&#x6684;&#x6698;&#x669D;&#x66C1;&#x66B9;&#x66C9;&#x66BE;&#x66BC;67&quot;;
			map += &quot;&#x66C4;&#x66B8;&#x66D6;&#x66DA;&#x66E0;&#x663F;&#x66E6;&#x66E9;&#x66F0;&#x66F5;&#x66F7;&#x670F;&#x6716;&#x671E;&#x6726;&#x6727;&#x9738;&#x672E;&#x673F;&#x6736;&#x6741;&#x6738;&#x6737;&#x6746;&#x675E;&#x6760;&#x6759;&#x6763;&#x6764;&#x6789;&#x6770;&#x67A9;&#x677C;&#x676A;&#x678C;&#x678B;&#x67A6;&#x67A1;&#x6785;&#x67B7;&#x67EF;&#x67B4;&#x67EC;&#x67B3;&#x67E9;&#x67B8;&#x67E4;&#x67DE;&#x67DD;&#x67E2;&#x67EE;&#x67B9;&#x67CE;&#x67C6;&#x67E7;&#x6A9C;&#x681E;&#x6846;&#x6829;&#x6840;&#x684D;&#x6832;&#x684E;1&#x68B3;&#x682B;&#x6859;&#x6863;&#x6877;&#x687F;&#x689F;&#x688F;&#x68AD;&#x6894;&#x689D;&#x689B;&#x6883;&#x6AAE;&#x68B9;&#x6874;&#x68B5;&#x68A0;&#x68BA;&#x690F;&#x688D;&#x687E;&#x6901;&#x68CA;&#x6908;&#x68D8;&#x6922;&#x6926;&#x68E1;&#x690C;&#x68CD;&#x68D4;&#x68E7;&#x68D5;&#x6936;&#x6912;&#x6904;&#x68D7;&#x68E3;&#x6925;&#x68F9;&#x68E0;&#x68EF;&#x6928;&#x692A;&#x691A;&#x6923;&#x6921;&#x68C6;&#x6979;&#x6977;&#x695C;&#x6978;&#x696B;&#x6954;&#x697E;&#x696E;&#x6939;&#x6974;&#x693D;&#x6959;&#x6930;&#x6961;&#x695E;&#x695D;&#x6981;&#x696A;&#x69B2;&#x69AE;&#x69D0;&#x69BF;&#x69C1;&#x69D3;&#x69BE;&#x69CE;&#x5BE8;&#x69CA;&#x69DD;&#x69BB;&#x69C3;&#x69A7;&#x6A2E;&#x6991;&#x69A0;&#x699C;&#x6995;&#x69B4;&#x69DE;&#x69E8;&#x6A02;&#x6A1B;&#x69FF;&#x6B0A;&#x69F9;&#x69F2;&#x69E7;&#x6A05;&#x69B1;&#x6A1E;&#x69ED;&#x6A14;&#x69EB;&#x6A0A;&#x6A12;&#x6AC1;&#x6A23;&#x6A13;&#x6A44;&#x6A0C;&#x6A72;&#x6A36;&#x6A78;&#x6A47;&#x6A62;&#x6A59;&#x6A66;&#x6A48;&#x6A38;&#x6A22;&#x6A90;&#x6A8D;&#x6AA0;&#x6A84;&#x6AA2;&#x6AA3;67&quot;;
			map += &quot;&#x6A97;&#x8617;&#x6ABB;&#x6AC3;&#x6AC2;&#x6AB8;&#x6AB3;&#x6AAC;&#x6ADE;&#x6AD1;&#x6ADF;&#x6AAA;&#x6ADA;&#x6AEA;&#x6AFB;&#x6B05;&#x8616;&#x6AFA;&#x6B12;&#x6B16;&#x9B31;&#x6B1F;&#x6B38;&#x6B37;&#x76DC;&#x6B39;&#x98EE;&#x6B47;&#x6B43;&#x6B49;&#x6B50;&#x6B59;&#x6B54;&#x6B5B;&#x6B5F;&#x6B61;&#x6B78;&#x6B79;&#x6B7F;&#x6B80;&#x6B84;&#x6B83;&#x6B8D;&#x6B98;&#x6B95;&#x6B9E;&#x6BA4;&#x6BAA;&#x6BAB;&#x6BAF;&#x6BB2;&#x6BB1;&#x6BB3;&#x6BB7;&#x6BBC;&#x6BC6;&#x6BCB;&#x6BD3;&#x6BDF;&#x6BEC;&#x6BEB;&#x6BF3;&#x6BEF;1&#x9EBE;&#x6C08;&#x6C13;&#x6C14;&#x6C1B;&#x6C24;&#x6C23;&#x6C5E;&#x6C55;&#x6C62;&#x6C6A;&#x6C82;&#x6C8D;&#x6C9A;&#x6C81;&#x6C9B;&#x6C7E;&#x6C68;&#x6C73;&#x6C92;&#x6C90;&#x6CC4;&#x6CF1;&#x6CD3;&#x6CBD;&#x6CD7;&#x6CC5;&#x6CDD;&#x6CAE;&#x6CB1;&#x6CBE;&#x6CBA;&#x6CDB;&#x6CEF;&#x6CD9;&#x6CEA;&#x6D1F;&#x884D;&#x6D36;&#x6D2B;&#x6D3D;&#x6D38;&#x6D19;&#x6D35;&#x6D33;&#x6D12;&#x6D0C;&#x6D63;&#x6D93;&#x6D64;&#x6D5A;&#x6D79;&#x6D59;&#x6D8E;&#x6D95;&#x6FE4;&#x6D85;&#x6DF9;&#x6E15;&#x6E0A;&#x6DB5;&#x6DC7;&#x6DE6;&#x6DB8;&#x6DC6;&#x6DEC;&#x6DDE;&#x6DCC;&#x6DE8;&#x6DD2;&#x6DC5;&#x6DFA;&#x6DD9;&#x6DE4;&#x6DD5;&#x6DEA;&#x6DEE;&#x6E2D;&#x6E6E;&#x6E2E;&#x6E19;&#x6E72;&#x6E5F;&#x6E3E;&#x6E23;&#x6E6B;&#x6E2B;&#x6E76;&#x6E4D;&#x6E1F;&#x6E43;&#x6E3A;&#x6E4E;&#x6E24;&#x6EFF;&#x6E1D;&#x6E38;&#x6E82;&#x6EAA;&#x6E98;&#x6EC9;&#x6EB7;&#x6ED3;&#x6EBD;&#x6EAF;&#x6EC4;&#x6EB2;&#x6ED4;&#x6ED5;&#x6E8F;&#x6EA5;&#x6EC2;&#x6E9F;&#x6F41;&#x6F11;&#x704C;&#x6EEC;&#x6EF8;&#x6EFE;&#x6F3F;&#x6EF2;&#x6F31;&#x6EEF;&#x6F32;&#x6ECC;16451&quot;;
			map += &quot;&#x6F3E;&#x6F13;&#x6EF7;&#x6F86;&#x6F7A;&#x6F78;&#x6F81;&#x6F80;&#x6F6F;&#x6F5B;&#x6FF3;&#x6F6D;&#x6F82;&#x6F7C;&#x6F58;&#x6F8E;&#x6F91;&#x6FC2;&#x6F66;&#x6FB3;&#x6FA3;&#x6FA1;&#x6FA4;&#x6FB9;&#x6FC6;&#x6FAA;&#x6FDF;&#x6FD5;&#x6FEC;&#x6FD4;&#x6FD8;&#x6FF1;&#x6FEE;&#x6FDB;&#x7009;&#x700B;&#x6FFA;&#x7011;&#x7001;&#x700F;&#x6FFE;&#x701B;&#x701A;&#x6F74;&#x701D;&#x7018;&#x701F;&#x7030;&#x703E;&#x7032;&#x7051;&#x7063;&#x7099;&#x7092;&#x70AF;&#x70F1;&#x70AC;&#x70B8;&#x70B3;&#x70AE;&#x70DF;&#x70CB;&#x70DD;1&#x70D9;&#x7109;&#x70FD;&#x711C;&#x7119;&#x7165;&#x7155;&#x7188;&#x7166;&#x7162;&#x714C;&#x7156;&#x716C;&#x718F;&#x71FB;&#x7184;&#x7195;&#x71A8;&#x71AC;&#x71D7;&#x71B9;&#x71BE;&#x71D2;&#x71C9;&#x71D4;&#x71CE;&#x71E0;&#x71EC;&#x71E7;&#x71F5;&#x71FC;&#x71F9;&#x71FF;&#x720D;&#x7210;&#x721B;&#x7228;&#x722D;&#x722C;&#x7230;&#x7232;&#x723B;&#x723C;&#x723F;&#x7240;&#x7246;&#x724B;&#x7258;&#x7274;&#x727E;&#x7282;&#x7281;&#x7287;&#x7292;&#x7296;&#x72A2;&#x72A7;&#x72B9;&#x72B2;&#x72C3;&#x72C6;&#x72C4;&#x72CE;&#x72D2;&#x72E2;&#x72E0;&#x72E1;&#x72F9;&#x72F7;&#x500F;&#x7317;&#x730A;&#x731C;&#x7316;&#x731D;&#x7334;&#x732F;&#x7329;&#x7325;&#x733E;&#x734E;&#x734F;&#x9ED8;&#x7357;&#x736A;&#x7368;&#x7370;&#x7378;&#x7375;&#x737B;&#x737A;&#x73C8;&#x73B3;&#x73CE;&#x73BB;&#x73C0;&#x73E5;&#x73EE;&#x73DE;&#x74A2;&#x7405;&#x746F;&#x7425;&#x73F8;&#x7432;&#x743A;&#x7455;&#x743F;&#x745F;&#x7459;&#x7441;&#x745C;&#x7469;&#x7470;&#x7463;&#x746A;&#x7476;&#x747E;&#x748B;&#x749E;&#x74A7;&#x74CA;&#x74CF;&#x74D4;&#x73F1;67&quot;;
			map += &quot;&#x74E0;&#x74E3;&#x74E7;&#x74E9;&#x74EE;&#x74F2;&#x74F0;&#x74F1;&#x74F8;&#x74F7;&#x7504;&#x7503;&#x7505;&#x750C;&#x750E;&#x750D;&#x7515;&#x7513;&#x751E;&#x7526;&#x752C;&#x753C;&#x7544;&#x754D;&#x754A;&#x7549;&#x755B;&#x7546;&#x755A;&#x7569;&#x7564;&#x7567;&#x756B;&#x756D;&#x7578;&#x7576;&#x7586;&#x7587;&#x7574;&#x758A;&#x7589;&#x7582;&#x7594;&#x759A;&#x759D;&#x75A5;&#x75A3;&#x75C2;&#x75B3;&#x75C3;&#x75B5;&#x75BD;&#x75B8;&#x75BC;&#x75B1;&#x75CD;&#x75CA;&#x75D2;&#x75D9;&#x75E3;&#x75DE;&#x75FE;&#x75FF;1&#x75FC;&#x7601;&#x75F0;&#x75FA;&#x75F2;&#x75F3;&#x760B;&#x760D;&#x7609;&#x761F;&#x7627;&#x7620;&#x7621;&#x7622;&#x7624;&#x7634;&#x7630;&#x763B;&#x7647;&#x7648;&#x7646;&#x765C;&#x7658;&#x7661;&#x7662;&#x7668;&#x7669;&#x766A;&#x7667;&#x766C;&#x7670;&#x7672;&#x7676;&#x7678;&#x767C;&#x7680;&#x7683;&#x7688;&#x768B;&#x768E;&#x7696;&#x7693;&#x7699;&#x769A;&#x76B0;&#x76B4;&#x76B8;&#x76B9;&#x76BA;&#x76C2;&#x76CD;&#x76D6;&#x76D2;&#x76DE;&#x76E1;&#x76E5;&#x76E7;&#x76EA;&#x862F;&#x76FB;&#x7708;&#x7707;&#x7704;&#x7729;&#x7724;&#x771E;&#x7725;&#x7726;&#x771B;&#x7737;&#x7738;&#x7747;&#x775A;&#x7768;&#x776B;&#x775B;&#x7765;&#x777F;&#x777E;&#x7779;&#x778E;&#x778B;&#x7791;&#x77A0;&#x779E;&#x77B0;&#x77B6;&#x77B9;&#x77BF;&#x77BC;&#x77BD;&#x77BB;&#x77C7;&#x77CD;&#x77D7;&#x77DA;&#x77DC;&#x77E3;&#x77EE;&#x77FC;&#x780C;&#x7812;&#x7926;&#x7820;&#x792A;&#x7845;&#x788E;&#x7874;&#x7886;&#x787C;&#x789A;&#x788C;&#x78A3;&#x78B5;&#x78AA;&#x78AF;&#x78D1;&#x78C6;&#x78CB;&#x78D4;&#x78BE;&#x78BC;&#x78C5;&#x78CA;&#x78EC;67&quot;;
			map += &quot;&#x78E7;&#x78DA;&#x78FD;&#x78F4;&#x7907;&#x7912;&#x7911;&#x7919;&#x792C;&#x792B;&#x7940;&#x7960;&#x7957;&#x795F;&#x795A;&#x7955;&#x7953;&#x797A;&#x797F;&#x798A;&#x799D;&#x79A7;&#x9F4B;&#x79AA;&#x79AE;&#x79B3;&#x79B9;&#x79BA;&#x79C9;&#x79D5;&#x79E7;&#x79EC;&#x79E1;&#x79E3;&#x7A08;&#x7A0D;&#x7A18;&#x7A19;&#x7A20;&#x7A1F;&#x7980;&#x7A31;&#x7A3B;&#x7A3E;&#x7A37;&#x7A43;&#x7A57;&#x7A49;&#x7A61;&#x7A62;&#x7A69;&#x9F9D;&#x7A70;&#x7A79;&#x7A7D;&#x7A88;&#x7A97;&#x7A95;&#x7A98;&#x7A96;&#x7AA9;&#x7AC8;&#x7AB0;1&#x7AB6;&#x7AC5;&#x7AC4;&#x7ABF;&#x9083;&#x7AC7;&#x7ACA;&#x7ACD;&#x7ACF;&#x7AD5;&#x7AD3;&#x7AD9;&#x7ADA;&#x7ADD;&#x7AE1;&#x7AE2;&#x7AE6;&#x7AED;&#x7AF0;&#x7B02;&#x7B0F;&#x7B0A;&#x7B06;&#x7B33;&#x7B18;&#x7B19;&#x7B1E;&#x7B35;&#x7B28;&#x7B36;&#x7B50;&#x7B7A;&#x7B04;&#x7B4D;&#x7B0B;&#x7B4C;&#x7B45;&#x7B75;&#x7B65;&#x7B74;&#x7B67;&#x7B70;&#x7B71;&#x7B6C;&#x7B6E;&#x7B9D;&#x7B98;&#x7B9F;&#x7B8D;&#x7B9C;&#x7B9A;&#x7B8B;&#x7B92;&#x7B8F;&#x7B5D;&#x7B99;&#x7BCB;&#x7BC1;&#x7BCC;&#x7BCF;&#x7BB4;&#x7BC6;&#x7BDD;&#x7BE9;&#x7C11;&#x7C14;&#x7BE6;&#x7BE5;&#x7C60;&#x7C00;&#x7C07;&#x7C13;&#x7BF3;&#x7BF7;&#x7C17;&#x7C0D;&#x7BF6;&#x7C23;&#x7C27;&#x7C2A;&#x7C1F;&#x7C37;&#x7C2B;&#x7C3D;&#x7C4C;&#x7C43;&#x7C54;&#x7C4F;&#x7C40;&#x7C50;&#x7C58;&#x7C5F;&#x7C64;&#x7C56;&#x7C65;&#x7C6C;&#x7C75;&#x7C83;&#x7C90;&#x7CA4;&#x7CAD;&#x7CA2;&#x7CAB;&#x7CA1;&#x7CA8;&#x7CB3;&#x7CB2;&#x7CB1;&#x7CAE;&#x7CB9;&#x7CBD;&#x7CC0;&#x7CC5;&#x7CC2;&#x7CD8;&#x7CD2;&#x7CDC;&#x7CE2;&#x9B3B;&#x7CEF;&#x7CF2;&#x7CF4;&#x7CF6;&#x7CFA;&#x7D06;67&quot;;
			map += &quot;&#x7D02;&#x7D1C;&#x7D15;&#x7D0A;&#x7D45;&#x7D4B;&#x7D2E;&#x7D32;&#x7D3F;&#x7D35;&#x7D46;&#x7D73;&#x7D56;&#x7D4E;&#x7D72;&#x7D68;&#x7D6E;&#x7D4F;&#x7D63;&#x7D93;&#x7D89;&#x7D5B;&#x7D8F;&#x7D7D;&#x7D9B;&#x7DBA;&#x7DAE;&#x7DA3;&#x7DB5;&#x7DC7;&#x7DBD;&#x7DAB;&#x7E3D;&#x7DA2;&#x7DAF;&#x7DDC;&#x7DB8;&#x7D9F;&#x7DB0;&#x7DD8;&#x7DDD;&#x7DE4;&#x7DDE;&#x7DFB;&#x7DF2;&#x7DE1;&#x7E05;&#x7E0A;&#x7E23;&#x7E21;&#x7E12;&#x7E31;&#x7E1F;&#x7E09;&#x7E0B;&#x7E22;&#x7E46;&#x7E66;&#x7E3B;&#x7E35;&#x7E39;&#x7E43;&#x7E37;1&#x7E32;&#x7E3A;&#x7E67;&#x7E5D;&#x7E56;&#x7E5E;&#x7E59;&#x7E5A;&#x7E79;&#x7E6A;&#x7E69;&#x7E7C;&#x7E7B;&#x7E83;&#x7DD5;&#x7E7D;&#x8FAE;&#x7E7F;&#x7E88;&#x7E89;&#x7E8C;&#x7E92;&#x7E90;&#x7E93;&#x7E94;&#x7E96;&#x7E8E;&#x7E9B;&#x7E9C;&#x7F38;&#x7F3A;&#x7F45;&#x7F4C;&#x7F4D;&#x7F4E;&#x7F50;&#x7F51;&#x7F55;&#x7F54;&#x7F58;&#x7F5F;&#x7F60;&#x7F68;&#x7F69;&#x7F67;&#x7F78;&#x7F82;&#x7F86;&#x7F83;&#x7F88;&#x7F87;&#x7F8C;&#x7F94;&#x7F9E;&#x7F9D;&#x7F9A;&#x7FA3;&#x7FAF;&#x7FB2;&#x7FB9;&#x7FAE;&#x7FB6;&#x7FB8;&#x8B71;&#x7FC5;&#x7FC6;&#x7FCA;&#x7FD5;&#x7FD4;&#x7FE1;&#x7FE6;&#x7FE9;&#x7FF3;&#x7FF9;&#x98DC;&#x8006;&#x8004;&#x800B;&#x8012;&#x8018;&#x8019;&#x801C;&#x8021;&#x8028;&#x803F;&#x803B;&#x804A;&#x8046;&#x8052;&#x8058;&#x805A;&#x805F;&#x8062;&#x8068;&#x8073;&#x8072;&#x8070;&#x8076;&#x8079;&#x807D;&#x807F;&#x8084;&#x8086;&#x8085;&#x809B;&#x8093;&#x809A;&#x80AD;&#x5190;&#x80AC;&#x80DB;&#x80E5;&#x80D9;&#x80DD;&#x80C4;&#x80DA;&#x80D6;&#x8109;&#x80EF;&#x80F1;&#x811B;&#x8129;&#x8123;&#x812F;&#x814B;67&quot;
			map += &quot;&#x968B;&#x8146;&#x813E;&#x8153;&#x8151;&#x80FC;&#x8171;&#x816E;&#x8165;&#x8166;&#x8174;&#x8183;&#x8188;&#x818A;&#x8180;&#x8182;&#x81A0;&#x8195;&#x81A4;&#x81A3;&#x815F;&#x8193;&#x81A9;&#x81B0;&#x81B5;&#x81BE;&#x81B8;&#x81BD;&#x81C0;&#x81C2;&#x81BA;&#x81C9;&#x81CD;&#x81D1;&#x81D9;&#x81D8;&#x81C8;&#x81DA;&#x81DF;&#x81E0;&#x81E7;&#x81FA;&#x81FB;&#x81FE;&#x8201;&#x8202;&#x8205;&#x8207;&#x820A;&#x820D;&#x8210;&#x8216;&#x8229;&#x822B;&#x8238;&#x8233;&#x8240;&#x8259;&#x8258;&#x825D;&#x825A;&#x825F;&#x8264;1&#x8262;&#x8268;&#x826A;&#x826B;&#x822E;&#x8271;&#x8277;&#x8278;&#x827E;&#x828D;&#x8292;&#x82AB;&#x829F;&#x82BB;&#x82AC;&#x82E1;&#x82E3;&#x82DF;&#x82D2;&#x82F4;&#x82F3;&#x82FA;&#x8393;&#x8303;&#x82FB;&#x82F9;&#x82DE;&#x8306;&#x82DC;&#x8309;&#x82D9;&#x8335;&#x8334;&#x8316;&#x8332;&#x8331;&#x8340;&#x8339;&#x8350;&#x8345;&#x832F;&#x832B;&#x8317;&#x8318;&#x8385;&#x839A;&#x83AA;&#x839F;&#x83A2;&#x8396;&#x8323;&#x838E;&#x8387;&#x838A;&#x837C;&#x83B5;&#x8373;&#x8375;&#x83A0;&#x8389;&#x83A8;&#x83F4;&#x8413;&#x83EB;&#x83CE;&#x83FD;&#x8403;&#x83D8;&#x840B;&#x83C1;&#x83F7;&#x8407;&#x83E0;&#x83F2;&#x840D;&#x8422;&#x8420;&#x83BD;&#x8438;&#x8506;&#x83FB;&#x846D;&#x842A;&#x843C;&#x855A;&#x8484;&#x8477;&#x846B;&#x84AD;&#x846E;&#x8482;&#x8469;&#x8446;&#x842C;&#x846F;&#x8479;&#x8435;&#x84CA;&#x8462;&#x84B9;&#x84BF;&#x849F;&#x84D9;&#x84CD;&#x84BB;&#x84DA;&#x84D0;&#x84C1;&#x84C6;&#x84D6;&#x84A1;&#x8521;&#x84FF;&#x84F4;&#x8517;&#x8518;&#x852C;&#x851F;&#x8515;&#x8514;&#x84FC;&#x8540;&#x8563;&#x8558;&#x8548;67&quot;
			map += &quot;&#x8541;&#x8602;&#x854B;&#x8555;&#x8580;&#x85A4;&#x8588;&#x8591;&#x858A;&#x85A8;&#x856D;&#x8594;&#x859B;&#x85EA;&#x8587;&#x859C;&#x8577;&#x857E;&#x8590;&#x85C9;&#x85BA;&#x85CF;&#x85B9;&#x85D0;&#x85D5;&#x85DD;&#x85E5;&#x85DC;&#x85F9;&#x860A;&#x8613;&#x860B;&#x85FE;&#x85FA;&#x8606;&#x8622;&#x861A;&#x8630;&#x863F;&#x864D;&#x4E55;&#x8654;&#x865F;&#x8667;&#x8671;&#x8693;&#x86A3;&#x86A9;&#x86AA;&#x868B;&#x868C;&#x86B6;&#x86AF;&#x86C4;&#x86C6;&#x86B0;&#x86C9;&#x8823;&#x86AB;&#x86D4;&#x86DE;&#x86E9;&#x86EC;1&#x86DF;&#x86DB;&#x86EF;&#x8712;&#x8706;&#x8708;&#x8700;&#x8703;&#x86FB;&#x8711;&#x8709;&#x870D;&#x86F9;&#x870A;&#x8734;&#x873F;&#x8737;&#x873B;&#x8725;&#x8729;&#x871A;&#x8760;&#x875F;&#x8778;&#x874C;&#x874E;&#x8774;&#x8757;&#x8768;&#x876E;&#x8759;&#x8753;&#x8763;&#x876A;&#x8805;&#x87A2;&#x879F;&#x8782;&#x87AF;&#x87CB;&#x87BD;&#x87C0;&#x87D0;&#x96D6;&#x87AB;&#x87C4;&#x87B3;&#x87C7;&#x87C6;&#x87BB;&#x87EF;&#x87F2;&#x87E0;&#x880F;&#x880D;&#x87FE;&#x87F6;&#x87F7;&#x880E;&#x87D2;&#x8811;&#x8816;&#x8815;&#x8822;&#x8821;&#x8831;&#x8836;&#x8839;&#x8827;&#x883B;&#x8844;&#x8842;&#x8852;&#x8859;&#x885E;&#x8862;&#x886B;&#x8881;&#x887E;&#x889E;&#x8875;&#x887D;&#x88B5;&#x8872;&#x8882;&#x8897;&#x8892;&#x88AE;&#x8899;&#x88A2;&#x888D;&#x88A4;&#x88B0;&#x88BF;&#x88B1;&#x88C3;&#x88C4;&#x88D4;&#x88D8;&#x88D9;&#x88DD;&#x88F9;&#x8902;&#x88FC;&#x88F4;&#x88E8;&#x88F2;&#x8904;&#x890C;&#x890A;&#x8913;&#x8943;&#x891E;&#x8925;&#x892A;&#x892B;&#x8941;&#x8944;&#x893B;&#x8936;&#x8938;&#x894C;&#x891D;&#x8960;&#x895E;67&quot;
			map += &quot;&#x8966;&#x8964;&#x896D;&#x896A;&#x896F;&#x8974;&#x8977;&#x897E;&#x8983;&#x8988;&#x898A;&#x8993;&#x8998;&#x89A1;&#x89A9;&#x89A6;&#x89AC;&#x89AF;&#x89B2;&#x89BA;&#x89BD;&#x89BF;&#x89C0;&#x89DA;&#x89DC;&#x89DD;&#x89E7;&#x89F4;&#x89F8;&#x8A03;&#x8A16;&#x8A10;&#x8A0C;&#x8A1B;&#x8A1D;&#x8A25;&#x8A36;&#x8A41;&#x8A5B;&#x8A52;&#x8A46;&#x8A48;&#x8A7C;&#x8A6D;&#x8A6C;&#x8A62;&#x8A85;&#x8A82;&#x8A84;&#x8AA8;&#x8AA1;&#x8A91;&#x8AA5;&#x8AA6;&#x8A9A;&#x8AA3;&#x8AC4;&#x8ACD;&#x8AC2;&#x8ADA;&#x8AEB;&#x8AF3;&#x8AE7;1&#x8AE4;&#x8AF1;&#x8B14;&#x8AE0;&#x8AE2;&#x8AF7;&#x8ADE;&#x8ADB;&#x8B0C;&#x8B07;&#x8B1A;&#x8AE1;&#x8B16;&#x8B10;&#x8B17;&#x8B20;&#x8B33;&#x97AB;&#x8B26;&#x8B2B;&#x8B3E;&#x8B28;&#x8B41;&#x8B4C;&#x8B4F;&#x8B4E;&#x8B49;&#x8B56;&#x8B5B;&#x8B5A;&#x8B6B;&#x8B5F;&#x8B6C;&#x8B6F;&#x8B74;&#x8B7D;&#x8B80;&#x8B8C;&#x8B8E;&#x8B92;&#x8B93;&#x8B96;&#x8B99;&#x8B9A;&#x8C3A;&#x8C41;&#x8C3F;&#x8C48;&#x8C4C;&#x8C4E;&#x8C50;&#x8C55;&#x8C62;&#x8C6C;&#x8C78;&#x8C7A;&#x8C82;&#x8C89;&#x8C85;&#x8C8A;&#x8C8D;&#x8C8E;&#x8C94;&#x8C7C;&#x8C98;&#x621D;&#x8CAD;&#x8CAA;&#x8CBD;&#x8CB2;&#x8CB3;&#x8CAE;&#x8CB6;&#x8CC8;&#x8CC1;&#x8CE4;&#x8CE3;&#x8CDA;&#x8CFD;&#x8CFA;&#x8CFB;&#x8D04;&#x8D05;&#x8D0A;&#x8D07;&#x8D0F;&#x8D0D;&#x8D10;&#x9F4E;&#x8D13;&#x8CCD;&#x8D14;&#x8D16;&#x8D67;&#x8D6D;&#x8D71;&#x8D73;&#x8D81;&#x8D99;&#x8DC2;&#x8DBE;&#x8DBA;&#x8DCF;&#x8DDA;&#x8DD6;&#x8DCC;&#x8DDB;&#x8DCB;&#x8DEA;&#x8DEB;&#x8DDF;&#x8DE3;&#x8DFC;&#x8E08;&#x8E09;&#x8DFF;&#x8E1D;&#x8E1E;&#x8E10;&#x8E1F;&#x8E42;&#x8E35;&#x8E30;&#x8E34;&#x8E4A;67&quot;
			map += &quot;&#x8E47;&#x8E49;&#x8E4C;&#x8E50;&#x8E48;&#x8E59;&#x8E64;&#x8E60;&#x8E2A;&#x8E63;&#x8E55;&#x8E76;&#x8E72;&#x8E7C;&#x8E81;&#x8E87;&#x8E85;&#x8E84;&#x8E8B;&#x8E8A;&#x8E93;&#x8E91;&#x8E94;&#x8E99;&#x8EAA;&#x8EA1;&#x8EAC;&#x8EB0;&#x8EC6;&#x8EB1;&#x8EBE;&#x8EC5;&#x8EC8;&#x8ECB;&#x8EDB;&#x8EE3;&#x8EFC;&#x8EFB;&#x8EEB;&#x8EFE;&#x8F0A;&#x8F05;&#x8F15;&#x8F12;&#x8F19;&#x8F13;&#x8F1C;&#x8F1F;&#x8F1B;&#x8F0C;&#x8F26;&#x8F33;&#x8F3B;&#x8F39;&#x8F45;&#x8F42;&#x8F3E;&#x8F4C;&#x8F49;&#x8F46;&#x8F4E;&#x8F57;&#x8F5C;1&#x8F62;&#x8F63;&#x8F64;&#x8F9C;&#x8F9F;&#x8FA3;&#x8FAD;&#x8FAF;&#x8FB7;&#x8FDA;&#x8FE5;&#x8FE2;&#x8FEA;&#x8FEF;&#x9087;&#x8FF4;&#x9005;&#x8FF9;&#x8FFA;&#x9011;&#x9015;&#x9021;&#x900D;&#x901E;&#x9016;&#x900B;&#x9027;&#x9036;&#x9035;&#x9039;&#x8FF8;&#x904F;&#x9050;&#x9051;&#x9052;&#x900E;&#x9049;&#x903E;&#x9056;&#x9058;&#x905E;&#x9068;&#x906F;&#x9076;&#x96A8;&#x9072;&#x9082;&#x907D;&#x9081;&#x9080;&#x908A;&#x9089;&#x908F;&#x90A8;&#x90AF;&#x90B1;&#x90B5;&#x90E2;&#x90E4;&#x6248;&#x90DB;&#x9102;&#x9112;&#x9119;&#x9132;&#x9130;&#x914A;&#x9156;&#x9158;&#x9163;&#x9165;&#x9169;&#x9173;&#x9172;&#x918B;&#x9189;&#x9182;&#x91A2;&#x91AB;&#x91AF;&#x91AA;&#x91B5;&#x91B4;&#x91BA;&#x91C0;&#x91C1;&#x91C9;&#x91CB;&#x91D0;&#x91D6;&#x91DF;&#x91E1;&#x91DB;&#x91FC;&#x91F5;&#x91F6;&#x921E;&#x91FF;&#x9214;&#x922C;&#x9215;&#x9211;&#x925E;&#x9257;&#x9245;&#x9249;&#x9264;&#x9248;&#x9295;&#x923F;&#x924B;&#x9250;&#x929C;&#x9296;&#x9293;&#x929B;&#x925A;&#x92CF;&#x92B9;&#x92B7;&#x92E9;&#x930F;&#x92FA;&#x9344;&#x932E;67&quot;
			map += &quot;&#x9319;&#x9322;&#x931A;&#x9323;&#x933A;&#x9335;&#x933B;&#x935C;&#x9360;&#x937C;&#x936E;&#x9356;&#x93B0;&#x93AC;&#x93AD;&#x9394;&#x93B9;&#x93D6;&#x93D7;&#x93E8;&#x93E5;&#x93D8;&#x93C3;&#x93DD;&#x93D0;&#x93C8;&#x93E4;&#x941A;&#x9414;&#x9413;&#x9403;&#x9407;&#x9410;&#x9436;&#x942B;&#x9435;&#x9421;&#x943A;&#x9441;&#x9452;&#x9444;&#x945B;&#x9460;&#x9462;&#x945E;&#x946A;&#x9229;&#x9470;&#x9475;&#x9477;&#x947D;&#x945A;&#x947C;&#x947E;&#x9481;&#x947F;&#x9582;&#x9587;&#x958A;&#x9594;&#x9596;&#x9598;&#x9599;1&#x95A0;&#x95A8;&#x95A7;&#x95AD;&#x95BC;&#x95BB;&#x95B9;&#x95BE;&#x95CA;&#x6FF6;&#x95C3;&#x95CD;&#x95CC;&#x95D5;&#x95D4;&#x95D6;&#x95DC;&#x95E1;&#x95E5;&#x95E2;&#x9621;&#x9628;&#x962E;&#x962F;&#x9642;&#x964C;&#x964F;&#x964B;&#x9677;&#x965C;&#x965E;&#x965D;&#x965F;&#x9666;&#x9672;&#x966C;&#x968D;&#x9698;&#x9695;&#x9697;&#x96AA;&#x96A7;&#x96B1;&#x96B2;&#x96B0;&#x96B4;&#x96B6;&#x96B8;&#x96B9;&#x96CE;&#x96CB;&#x96C9;&#x96CD;&#x894D;&#x96DC;&#x970D;&#x96D5;&#x96F9;&#x9704;&#x9706;&#x9708;&#x9713;&#x970E;&#x9711;&#x970F;&#x9716;&#x9719;&#x9724;&#x972A;&#x9730;&#x9739;&#x973D;&#x973E;&#x9744;&#x9746;&#x9748;&#x9742;&#x9749;&#x975C;&#x9760;&#x9764;&#x9766;&#x9768;&#x52D2;&#x976B;&#x9771;&#x9779;&#x9785;&#x977C;&#x9781;&#x977A;&#x9786;&#x978B;&#x978F;&#x9790;&#x979C;&#x97A8;&#x97A6;&#x97A3;&#x97B3;&#x97B4;&#x97C3;&#x97C6;&#x97C8;&#x97CB;&#x97DC;&#x97ED;&#x9F4F;&#x97F2;&#x7ADF;&#x97F6;&#x97F5;&#x980F;&#x980C;&#x9838;&#x9824;&#x9821;&#x9837;&#x983D;&#x9846;&#x984F;&#x984B;&#x986B;&#x986F;&#x9870;67&quot;
			map += &quot;&#x9871;&#x9874;&#x9873;&#x98AA;&#x98AF;&#x98B1;&#x98B6;&#x98C4;&#x98C3;&#x98C6;&#x98E9;&#x98EB;&#x9903;&#x9909;&#x9912;&#x9914;&#x9918;&#x9921;&#x991D;&#x991E;&#x9924;&#x9920;&#x992C;&#x992E;&#x993D;&#x993E;&#x9942;&#x9949;&#x9945;&#x9950;&#x994B;&#x9951;&#x9952;&#x994C;&#x9955;&#x9997;&#x9998;&#x99A5;&#x99AD;&#x99AE;&#x99BC;&#x99DF;&#x99DB;&#x99DD;&#x99D8;&#x99D1;&#x99ED;&#x99EE;&#x99F1;&#x99F2;&#x99FB;&#x99F8;&#x9A01;&#x9A0F;&#x9A05;&#x99E2;&#x9A19;&#x9A2B;&#x9A37;&#x9A45;&#x9A42;&#x9A40;&#x9A43;1&#x9A3E;&#x9A55;&#x9A4D;&#x9A5B;&#x9A57;&#x9A5F;&#x9A62;&#x9A65;&#x9A64;&#x9A69;&#x9A6B;&#x9A6A;&#x9AAD;&#x9AB0;&#x9ABC;&#x9AC0;&#x9ACF;&#x9AD1;&#x9AD3;&#x9AD4;&#x9ADE;&#x9ADF;&#x9AE2;&#x9AE3;&#x9AE6;&#x9AEF;&#x9AEB;&#x9AEE;&#x9AF4;&#x9AF1;&#x9AF7;&#x9AFB;&#x9B06;&#x9B18;&#x9B1A;&#x9B1F;&#x9B22;&#x9B23;&#x9B25;&#x9B27;&#x9B28;&#x9B29;&#x9B2A;&#x9B2E;&#x9B2F;&#x9B32;&#x9B44;&#x9B43;&#x9B4F;&#x9B4D;&#x9B4E;&#x9B51;&#x9B58;&#x9B74;&#x9B93;&#x9B83;&#x9B91;&#x9B96;&#x9B97;&#x9B9F;&#x9BA0;&#x9BA8;&#x9BB4;&#x9BC0;&#x9BCA;&#x9BB9;&#x9BC6;&#x9BCF;&#x9BD1;&#x9BD2;&#x9BE3;&#x9BE2;&#x9BE4;&#x9BD4;&#x9BE1;&#x9C3A;&#x9BF2;&#x9BF1;&#x9BF0;&#x9C15;&#x9C14;&#x9C09;&#x9C13;&#x9C0C;&#x9C06;&#x9C08;&#x9C12;&#x9C0A;&#x9C04;&#x9C2E;&#x9C1B;&#x9C25;&#x9C24;&#x9C21;&#x9C30;&#x9C47;&#x9C32;&#x9C46;&#x9C3E;&#x9C5A;&#x9C60;&#x9C67;&#x9C76;&#x9C78;&#x9CE7;&#x9CEC;&#x9CF0;&#x9D09;&#x9D08;&#x9CEB;&#x9D03;&#x9D06;&#x9D2A;&#x9D26;&#x9DAF;&#x9D23;&#x9D1F;&#x9D44;&#x9D15;&#x9D12;&#x9D41;&#x9D3F;&#x9D3E;&#x9D46;&#x9D48;67&quot;
			map += &quot;&#x9D5D;&#x9D5E;&#x9D64;&#x9D51;&#x9D50;&#x9D59;&#x9D72;&#x9D89;&#x9D87;&#x9DAB;&#x9D6F;&#x9D7A;&#x9D9A;&#x9DA4;&#x9DA9;&#x9DB2;&#x9DC4;&#x9DC1;&#x9DBB;&#x9DB8;&#x9DBA;&#x9DC6;&#x9DCF;&#x9DC2;&#x9DD9;&#x9DD3;&#x9DF8;&#x9DE6;&#x9DED;&#x9DEF;&#x9DFD;&#x9E1A;&#x9E1B;&#x9E1E;&#x9E75;&#x9E79;&#x9E7D;&#x9E81;&#x9E88;&#x9E8B;&#x9E8C;&#x9E92;&#x9E95;&#x9E91;&#x9E9D;&#x9EA5;&#x9EA9;&#x9EB8;&#x9EAA;&#x9EAD;&#x9761;&#x9ECC;&#x9ECE;&#x9ECF;&#x9ED0;&#x9ED4;&#x9EDC;&#x9EDE;&#x9EDD;&#x9EE0;&#x9EE5;&#x9EE8;&#x9EEF;1&#x9EF4;&#x9EF6;&#x9EF7;&#x9EF9;&#x9EFB;&#x9EFC;&#x9EFD;&#x9F07;&#x9F08;&#x76B7;&#x9F15;&#x9F21;&#x9F2C;&#x9F3E;&#x9F4A;&#x9F52;&#x9F54;&#x9F63;&#x9F5F;&#x9F60;&#x9F61;&#x9F66;&#x9F67;&#x9F6C;&#x9F6A;&#x9F77;&#x9F72;&#x9F76;&#x9F95;&#x9F9C;&#x9FA0;&#x582F;&#x69C7;&#x9059;&#x7464;&#x51DC;&#x7199;667&quot;
			map += &quot;&#x7E8A;&#x891C;&#x9348;&#x9288;&#x84DC;&#x4FC9;&#x70BB;&#x6631;&#x68C8;&#x92F9;&#x66FB;&#x5F45;&#x4E28;&#x4EE1;&#x4EFC;&#x4F00;&#x4F03;&#x4F39;&#x4F56;&#x4F92;&#x4F8A;&#x4F9A;&#x4F94;&#x4FCD;&#x5040;&#x5022;&#x4FFF;&#x501E;&#x5046;&#x5070;&#x5042;&#x5094;&#x50F4;&#x50D8;&#x514A;&#x5164;&#x519D;&#x51BE;&#x51EC;&#x5215;&#x529C;&#x52A6;&#x52C0;&#x52DB;&#x5300;&#x5307;&#x5324;&#x5372;&#x5393;&#x53B2;&#x53DD;&#xFA0E;&#x549C;&#x548A;&#x54A9;&#x54FF;&#x5586;&#x5759;&#x5765;&#x57AC;&#x57C8;&#x57C7;&#xFA0F;1&#xFA10;&#x589E;&#x58B2;&#x590B;&#x5953;&#x595B;&#x595D;&#x5963;&#x59A4;&#x59BA;&#x5B56;&#x5BC0;&#x752F;&#x5BD8;&#x5BEC;&#x5C1E;&#x5CA6;&#x5CBA;&#x5CF5;&#x5D27;&#x5D53;&#xFA11;&#x5D42;&#x5D6D;&#x5DB8;&#x5DB9;&#x5DD0;&#x5F21;&#x5F34;&#x5F67;&#x5FB7;&#x5FDE;&#x605D;&#x6085;&#x608A;&#x60DE;&#x60D5;&#x6120;&#x60F2;&#x6111;&#x6137;&#x6130;&#x6198;&#x6213;&#x62A6;&#x63F5;&#x6460;&#x649D;&#x64CE;&#x654E;&#x6600;&#x6615;&#x663B;&#x6609;&#x662E;&#x661E;&#x6624;&#x6665;&#x6657;&#x6659;&#xFA12;&#x6673;&#x6699;&#x66A0;&#x66B2;&#x66BF;&#x66FA;&#x670E;&#xF929;&#x6766;&#x67BB;&#x6852;&#x67C0;&#x6801;&#x6844;&#x68CF;&#xFA13;&#x6968;&#xFA14;&#x6998;&#x69E2;&#x6A30;&#x6A6B;&#x6A46;&#x6A73;&#x6A7E;&#x6AE2;&#x6AE4;&#x6BD6;&#x6C3F;&#x6C5C;&#x6C86;&#x6C6F;&#x6CDA;&#x6D04;&#x6D87;&#x6D6F;&#x6D96;&#x6DAC;&#x6DCF;&#x6DF8;&#x6DF2;&#x6DFC;&#x6E39;&#x6E5C;&#x6E27;&#x6E3C;&#x6EBF;&#x6F88;&#x6FB5;&#x6FF5;&#x7005;&#x7007;&#x7028;&#x7085;&#x70AB;&#x710F;&#x7104;&#x715C;&#x7146;&#x7147;&#xFA15;&#x71C1;&#x71FE;&#x72B1;67&quot;
			map += &quot;&#x72BE;&#x7324;&#xFA16;&#x7377;&#x73BD;&#x73C9;&#x73D6;&#x73E3;&#x73D2;&#x7407;&#x73F5;&#x7426;&#x742A;&#x7429;&#x742E;&#x7462;&#x7489;&#x749F;&#x7501;&#x756F;&#x7682;&#x769C;&#x769E;&#x769B;&#x76A6;&#xFA17;&#x7746;&#x52AF;&#x7821;&#x784E;&#x7864;&#x787A;&#x7930;&#xFA18;&#xFA19;&#xFA1A;&#x7994;&#xFA1B;&#x799B;&#x7AD1;&#x7AE7;&#xFA1C;&#x7AEB;&#x7B9E;&#xFA1D;&#x7D48;&#x7D5C;&#x7DB7;&#x7DA0;&#x7DD6;&#x7E52;&#x7F47;&#x7FA1;&#xFA1E;&#x8301;&#x8362;&#x837F;&#x83C7;&#x83F6;&#x8448;&#x84B4;&#x8553;&#x8559;1&#x856B;&#xFA1F;&#x85B0;&#xFA20;&#xFA21;&#x8807;&#x88F5;&#x8A12;&#x8A37;&#x8A79;&#x8AA7;&#x8ABE;&#x8ADF;&#xFA22;&#x8AF6;&#x8B53;&#x8B7F;&#x8CF0;&#x8CF4;&#x8D12;&#x8D76;&#xFA23;&#x8ECF;&#xFA24;&#xFA25;&#x9067;&#x90DE;&#xFA26;&#x9115;&#x9127;&#x91DA;&#x91D7;&#x91DE;&#x91ED;&#x91EE;&#x91E4;&#x91E5;&#x9206;&#x9210;&#x920A;&#x923A;&#x9240;&#x923C;&#x924E;&#x9259;&#x9251;&#x9239;&#x9267;&#x92A7;&#x9277;&#x9278;&#x92E7;&#x92D7;&#x92D9;&#x92D0;&#xFA27;&#x92D5;&#x92E0;&#x92D3;&#x9325;&#x9321;&#x92FB;&#xFA28;&#x931E;&#x92FF;&#x931D;&#x9302;&#x9370;&#x9357;&#x93A4;&#x93C6;&#x93DE;&#x93F8;&#x9431;&#x9445;&#x9448;&#x9592;&#xF9DC;&#xFA29;&#x969D;&#x96AF;&#x9733;&#x973B;&#x9743;&#x974D;&#x974F;&#x9751;&#x9755;&#x9857;&#x9865;&#xFA2A;&#xFA2B;&#x9927;&#xFA2C;&#x999E;&#x9A4E;&#x9AD9;&#x9ADC;&#x9B75;&#x9B72;&#x9B8F;&#x9BB1;&#x9BBB;&#x9C00;&#x9D70;&#x9D6B;&#xFA2D;&#x9E19;&#x9ED1;2&#x2170;&#x2171;&#x2172;&#x2173;&#x2174;&#x2175;&#x2176;&#x2177;&#x2178;&#x2179;&#xFFE2;&#xFFE4;&#xFF07;&#xFF02;323&quot;;
			map += &quot;&#xE000;&#xE001;&#xE002;&#xE003;&#xE004;&#xE005;&#xE006;&#xE007;&#xE008;&#xE009;&#xE00A;&#xE00B;&#xE00C;&#xE00D;&#xE00E;&#xE00F;&#xE010;&#xE011;&#xE012;&#xE013;&#xE014;&#xE015;&#xE016;&#xE017;&#xE018;&#xE019;&#xE01A;&#xE01B;&#xE01C;&#xE01D;&#xE01E;&#xE01F;&#xE020;&#xE021;&#xE022;&#xE023;&#xE024;&#xE025;&#xE026;&#xE027;&#xE028;&#xE029;&#xE02A;&#xE02B;&#xE02C;&#xE02D;&#xE02E;&#xE02F;&#xE030;&#xE031;&#xE032;&#xE033;&#xE034;&#xE035;&#xE036;&#xE037;&#xE038;&#xE039;&#xE03A;&#xE03B;&#xE03C;&#xE03D;&#xE03E;1&#xE03F;&#xE040;&#xE041;&#xE042;&#xE043;&#xE044;&#xE045;&#xE046;&#xE047;&#xE048;&#xE049;&#xE04A;&#xE04B;&#xE04C;&#xE04D;&#xE04E;&#xE04F;&#xE050;&#xE051;&#xE052;&#xE053;&#xE054;&#xE055;&#xE056;&#xE057;&#xE058;&#xE059;&#xE05A;&#xE05B;&#xE05C;&#xE05D;&#xE05E;&#xE05F;&#xE060;&#xE061;&#xE062;&#xE063;&#xE064;&#xE065;&#xE066;&#xE067;&#xE068;&#xE069;&#xE06A;&#xE06B;&#xE06C;&#xE06D;&#xE06E;&#xE06F;&#xE070;&#xE071;&#xE072;&#xE073;&#xE074;&#xE075;&#xE076;&#xE077;&#xE078;&#xE079;&#xE07A;&#xE07B;&#xE07C;&#xE07D;&#xE07E;&#xE07F;&#xE080;&#xE081;&#xE082;&#xE083;&#xE084;&#xE085;&#xE086;&#xE087;&#xE088;&#xE089;&#xE08A;&#xE08B;&#xE08C;&#xE08D;&#xE08E;&#xE08F;&#xE090;&#xE091;&#xE092;&#xE093;&#xE094;&#xE095;&#xE096;&#xE097;&#xE098;&#xE099;&#xE09A;&#xE09B;&#xE09C;&#xE09D;&#xE09E;&#xE09F;&#xE0A0;&#xE0A1;&#xE0A2;&#xE0A3;&#xE0A4;&#xE0A5;&#xE0A6;&#xE0A7;&#xE0A8;&#xE0A9;&#xE0AA;&#xE0AB;&#xE0AC;&#xE0AD;&#xE0AE;&#xE0AF;&#xE0B0;&#xE0B1;&#xE0B2;&#xE0B3;&#xE0B4;&#xE0B5;&#xE0B6;&#xE0B7;&#xE0B8;&#xE0B9;&#xE0BA;&#xE0BB;67&quot;;
			map += &quot;&#xE0BC;&#xE0BD;&#xE0BE;&#xE0BF;&#xE0C0;&#xE0C1;&#xE0C2;&#xE0C3;&#xE0C4;&#xE0C5;&#xE0C6;&#xE0C7;&#xE0C8;&#xE0C9;&#xE0CA;&#xE0CB;&#xE0CC;&#xE0CD;&#xE0CE;&#xE0CF;&#xE0D0;&#xE0D1;&#xE0D2;&#xE0D3;&#xE0D4;&#xE0D5;&#xE0D6;&#xE0D7;&#xE0D8;&#xE0D9;&#xE0DA;&#xE0DB;&#xE0DC;&#xE0DD;&#xE0DE;&#xE0DF;&#xE0E0;&#xE0E1;&#xE0E2;&#xE0E3;&#xE0E4;&#xE0E5;&#xE0E6;&#xE0E7;&#xE0E8;&#xE0E9;&#xE0EA;&#xE0EB;&#xE0EC;&#xE0ED;&#xE0EE;&#xE0EF;&#xE0F0;&#xE0F1;&#xE0F2;&#xE0F3;&#xE0F4;&#xE0F5;&#xE0F6;&#xE0F7;&#xE0F8;&#xE0F9;&#xE0FA;1&#xE0FB;&#xE0FC;&#xE0FD;&#xE0FE;&#xE0FF;&#xE100;&#xE101;&#xE102;&#xE103;&#xE104;&#xE105;&#xE106;&#xE107;&#xE108;&#xE109;&#xE10A;&#xE10B;&#xE10C;&#xE10D;&#xE10E;&#xE10F;&#xE110;&#xE111;&#xE112;&#xE113;&#xE114;&#xE115;&#xE116;&#xE117;&#xE118;&#xE119;&#xE11A;&#xE11B;&#xE11C;&#xE11D;&#xE11E;&#xE11F;&#xE120;&#xE121;&#xE122;&#xE123;&#xE124;&#xE125;&#xE126;&#xE127;&#xE128;&#xE129;&#xE12A;&#xE12B;&#xE12C;&#xE12D;&#xE12E;&#xE12F;&#xE130;&#xE131;&#xE132;&#xE133;&#xE134;&#xE135;&#xE136;&#xE137;&#xE138;&#xE139;&#xE13A;&#xE13B;&#xE13C;&#xE13D;&#xE13E;&#xE13F;&#xE140;&#xE141;&#xE142;&#xE143;&#xE144;&#xE145;&#xE146;&#xE147;&#xE148;&#xE149;&#xE14A;&#xE14B;&#xE14C;&#xE14D;&#xE14E;&#xE14F;&#xE150;&#xE151;&#xE152;&#xE153;&#xE154;&#xE155;&#xE156;&#xE157;&#xE158;&#xE159;&#xE15A;&#xE15B;&#xE15C;&#xE15D;&#xE15E;&#xE15F;&#xE160;&#xE161;&#xE162;&#xE163;&#xE164;&#xE165;&#xE166;&#xE167;&#xE168;&#xE169;&#xE16A;&#xE16B;&#xE16C;&#xE16D;&#xE16E;&#xE16F;&#xE170;&#xE171;&#xE172;&#xE173;&#xE174;&#xE175;&#xE176;&#xE177;67&quot;;
			map += &quot;&#xE178;&#xE179;&#xE17A;&#xE17B;&#xE17C;&#xE17D;&#xE17E;&#xE17F;&#xE180;&#xE181;&#xE182;&#xE183;&#xE184;&#xE185;&#xE186;&#xE187;&#xE188;&#xE189;&#xE18A;&#xE18B;&#xE18C;&#xE18D;&#xE18E;&#xE18F;&#xE190;&#xE191;&#xE192;&#xE193;&#xE194;&#xE195;&#xE196;&#xE197;&#xE198;&#xE199;&#xE19A;&#xE19B;&#xE19C;&#xE19D;&#xE19E;&#xE19F;&#xE1A0;&#xE1A1;&#xE1A2;&#xE1A3;&#xE1A4;&#xE1A5;&#xE1A6;&#xE1A7;&#xE1A8;&#xE1A9;&#xE1AA;&#xE1AB;&#xE1AC;&#xE1AD;&#xE1AE;&#xE1AF;&#xE1B0;&#xE1B1;&#xE1B2;&#xE1B3;&#xE1B4;&#xE1B5;&#xE1B6;1&#xE1B7;&#xE1B8;&#xE1B9;&#xE1BA;&#xE1BB;&#xE1BC;&#xE1BD;&#xE1BE;&#xE1BF;&#xE1C0;&#xE1C1;&#xE1C2;&#xE1C3;&#xE1C4;&#xE1C5;&#xE1C6;&#xE1C7;&#xE1C8;&#xE1C9;&#xE1CA;&#xE1CB;&#xE1CC;&#xE1CD;&#xE1CE;&#xE1CF;&#xE1D0;&#xE1D1;&#xE1D2;&#xE1D3;&#xE1D4;&#xE1D5;&#xE1D6;&#xE1D7;&#xE1D8;&#xE1D9;&#xE1DA;&#xE1DB;&#xE1DC;&#xE1DD;&#xE1DE;&#xE1DF;&#xE1E0;&#xE1E1;&#xE1E2;&#xE1E3;&#xE1E4;&#xE1E5;&#xE1E6;&#xE1E7;&#xE1E8;&#xE1E9;&#xE1EA;&#xE1EB;&#xE1EC;&#xE1ED;&#xE1EE;&#xE1EF;&#xE1F0;&#xE1F1;&#xE1F2;&#xE1F3;&#xE1F4;&#xE1F5;&#xE1F6;&#xE1F7;&#xE1F8;&#xE1F9;&#xE1FA;&#xE1FB;&#xE1FC;&#xE1FD;&#xE1FE;&#xE1FF;&#xE200;&#xE201;&#xE202;&#xE203;&#xE204;&#xE205;&#xE206;&#xE207;&#xE208;&#xE209;&#xE20A;&#xE20B;&#xE20C;&#xE20D;&#xE20E;&#xE20F;&#xE210;&#xE211;&#xE212;&#xE213;&#xE214;&#xE215;&#xE216;&#xE217;&#xE218;&#xE219;&#xE21A;&#xE21B;&#xE21C;&#xE21D;&#xE21E;&#xE21F;&#xE220;&#xE221;&#xE222;&#xE223;&#xE224;&#xE225;&#xE226;&#xE227;&#xE228;&#xE229;&#xE22A;&#xE22B;&#xE22C;&#xE22D;&#xE22E;&#xE22F;&#xE230;&#xE231;&#xE232;&#xE233;67&quot;;
			map += &quot;&#xE234;&#xE235;&#xE236;&#xE237;&#xE238;&#xE239;&#xE23A;&#xE23B;&#xE23C;&#xE23D;&#xE23E;&#xE23F;&#xE240;&#xE241;&#xE242;&#xE243;&#xE244;&#xE245;&#xE246;&#xE247;&#xE248;&#xE249;&#xE24A;&#xE24B;&#xE24C;&#xE24D;&#xE24E;&#xE24F;&#xE250;&#xE251;&#xE252;&#xE253;&#xE254;&#xE255;&#xE256;&#xE257;&#xE258;&#xE259;&#xE25A;&#xE25B;&#xE25C;&#xE25D;&#xE25E;&#xE25F;&#xE260;&#xE261;&#xE262;&#xE263;&#xE264;&#xE265;&#xE266;&#xE267;&#xE268;&#xE269;&#xE26A;&#xE26B;&#xE26C;&#xE26D;&#xE26E;&#xE26F;&#xE270;&#xE271;&#xE272;1&#xE273;&#xE274;&#xE275;&#xE276;&#xE277;&#xE278;&#xE279;&#xE27A;&#xE27B;&#xE27C;&#xE27D;&#xE27E;&#xE27F;&#xE280;&#xE281;&#xE282;&#xE283;&#xE284;&#xE285;&#xE286;&#xE287;&#xE288;&#xE289;&#xE28A;&#xE28B;&#xE28C;&#xE28D;&#xE28E;&#xE28F;&#xE290;&#xE291;&#xE292;&#xE293;&#xE294;&#xE295;&#xE296;&#xE297;&#xE298;&#xE299;&#xE29A;&#xE29B;&#xE29C;&#xE29D;&#xE29E;&#xE29F;&#xE2A0;&#xE2A1;&#xE2A2;&#xE2A3;&#xE2A4;&#xE2A5;&#xE2A6;&#xE2A7;&#xE2A8;&#xE2A9;&#xE2AA;&#xE2AB;&#xE2AC;&#xE2AD;&#xE2AE;&#xE2AF;&#xE2B0;&#xE2B1;&#xE2B2;&#xE2B3;&#xE2B4;&#xE2B5;&#xE2B6;&#xE2B7;&#xE2B8;&#xE2B9;&#xE2BA;&#xE2BB;&#xE2BC;&#xE2BD;&#xE2BE;&#xE2BF;&#xE2C0;&#xE2C1;&#xE2C2;&#xE2C3;&#xE2C4;&#xE2C5;&#xE2C6;&#xE2C7;&#xE2C8;&#xE2C9;&#xE2CA;&#xE2CB;&#xE2CC;&#xE2CD;&#xE2CE;&#xE2CF;&#xE2D0;&#xE2D1;&#xE2D2;&#xE2D3;&#xE2D4;&#xE2D5;&#xE2D6;&#xE2D7;&#xE2D8;&#xE2D9;&#xE2DA;&#xE2DB;&#xE2DC;&#xE2DD;&#xE2DE;&#xE2DF;&#xE2E0;&#xE2E1;&#xE2E2;&#xE2E3;&#xE2E4;&#xE2E5;&#xE2E6;&#xE2E7;&#xE2E8;&#xE2E9;&#xE2EA;&#xE2EB;&#xE2EC;&#xE2ED;&#xE2EE;&#xE2EF;67&quot;;
			map += &quot;&#xE2F0;&#xE2F1;&#xE2F2;&#xE2F3;&#xE2F4;&#xE2F5;&#xE2F6;&#xE2F7;&#xE2F8;&#xE2F9;&#xE2FA;&#xE2FB;&#xE2FC;&#xE2FD;&#xE2FE;&#xE2FF;&#xE300;&#xE301;&#xE302;&#xE303;&#xE304;&#xE305;&#xE306;&#xE307;&#xE308;&#xE309;&#xE30A;&#xE30B;&#xE30C;&#xE30D;&#xE30E;&#xE30F;&#xE310;&#xE311;&#xE312;&#xE313;&#xE314;&#xE315;&#xE316;&#xE317;&#xE318;&#xE319;&#xE31A;&#xE31B;&#xE31C;&#xE31D;&#xE31E;&#xE31F;&#xE320;&#xE321;&#xE322;&#xE323;&#xE324;&#xE325;&#xE326;&#xE327;&#xE328;&#xE329;&#xE32A;&#xE32B;&#xE32C;&#xE32D;&#xE32E;1&#xE32F;&#xE330;&#xE331;&#xE332;&#xE333;&#xE334;&#xE335;&#xE336;&#xE337;&#xE338;&#xE339;&#xE33A;&#xE33B;&#xE33C;&#xE33D;&#xE33E;&#xE33F;&#xE340;&#xE341;&#xE342;&#xE343;&#xE344;&#xE345;&#xE346;&#xE347;&#xE348;&#xE349;&#xE34A;&#xE34B;&#xE34C;&#xE34D;&#xE34E;&#xE34F;&#xE350;&#xE351;&#xE352;&#xE353;&#xE354;&#xE355;&#xE356;&#xE357;&#xE358;&#xE359;&#xE35A;&#xE35B;&#xE35C;&#xE35D;&#xE35E;&#xE35F;&#xE360;&#xE361;&#xE362;&#xE363;&#xE364;&#xE365;&#xE366;&#xE367;&#xE368;&#xE369;&#xE36A;&#xE36B;&#xE36C;&#xE36D;&#xE36E;&#xE36F;&#xE370;&#xE371;&#xE372;&#xE373;&#xE374;&#xE375;&#xE376;&#xE377;&#xE378;&#xE379;&#xE37A;&#xE37B;&#xE37C;&#xE37D;&#xE37E;&#xE37F;&#xE380;&#xE381;&#xE382;&#xE383;&#xE384;&#xE385;&#xE386;&#xE387;&#xE388;&#xE389;&#xE38A;&#xE38B;&#xE38C;&#xE38D;&#xE38E;&#xE38F;&#xE390;&#xE391;&#xE392;&#xE393;&#xE394;&#xE395;&#xE396;&#xE397;&#xE398;&#xE399;&#xE39A;&#xE39B;&#xE39C;&#xE39D;&#xE39E;&#xE39F;&#xE3A0;&#xE3A1;&#xE3A2;&#xE3A3;&#xE3A4;&#xE3A5;&#xE3A6;&#xE3A7;&#xE3A8;&#xE3A9;&#xE3AA;&#xE3AB;67&quot;;
			map += &quot;&#xE3AC;&#xE3AD;&#xE3AE;&#xE3AF;&#xE3B0;&#xE3B1;&#xE3B2;&#xE3B3;&#xE3B4;&#xE3B5;&#xE3B6;&#xE3B7;&#xE3B8;&#xE3B9;&#xE3BA;&#xE3BB;&#xE3BC;&#xE3BD;&#xE3BE;&#xE3BF;&#xE3C0;&#xE3C1;&#xE3C2;&#xE3C3;&#xE3C4;&#xE3C5;&#xE3C6;&#xE3C7;&#xE3C8;&#xE3C9;&#xE3CA;&#xE3CB;&#xE3CC;&#xE3CD;&#xE3CE;&#xE3CF;&#xE3D0;&#xE3D1;&#xE3D2;&#xE3D3;&#xE3D4;&#xE3D5;&#xE3D6;&#xE3D7;&#xE3D8;&#xE3D9;&#xE3DA;&#xE3DB;&#xE3DC;&#xE3DD;&#xE3DE;&#xE3DF;&#xE3E0;&#xE3E1;&#xE3E2;&#xE3E3;&#xE3E4;&#xE3E5;&#xE3E6;&#xE3E7;&#xE3E8;&#xE3E9;&#xE3EA;1&#xE3EB;&#xE3EC;&#xE3ED;&#xE3EE;&#xE3EF;&#xE3F0;&#xE3F1;&#xE3F2;&#xE3F3;&#xE3F4;&#xE3F5;&#xE3F6;&#xE3F7;&#xE3F8;&#xE3F9;&#xE3FA;&#xE3FB;&#xE3FC;&#xE3FD;&#xE3FE;&#xE3FF;&#xE400;&#xE401;&#xE402;&#xE403;&#xE404;&#xE405;&#xE406;&#xE407;&#xE408;&#xE409;&#xE40A;&#xE40B;&#xE40C;&#xE40D;&#xE40E;&#xE40F;&#xE410;&#xE411;&#xE412;&#xE413;&#xE414;&#xE415;&#xE416;&#xE417;&#xE418;&#xE419;&#xE41A;&#xE41B;&#xE41C;&#xE41D;&#xE41E;&#xE41F;&#xE420;&#xE421;&#xE422;&#xE423;&#xE424;&#xE425;&#xE426;&#xE427;&#xE428;&#xE429;&#xE42A;&#xE42B;&#xE42C;&#xE42D;&#xE42E;&#xE42F;&#xE430;&#xE431;&#xE432;&#xE433;&#xE434;&#xE435;&#xE436;&#xE437;&#xE438;&#xE439;&#xE43A;&#xE43B;&#xE43C;&#xE43D;&#xE43E;&#xE43F;&#xE440;&#xE441;&#xE442;&#xE443;&#xE444;&#xE445;&#xE446;&#xE447;&#xE448;&#xE449;&#xE44A;&#xE44B;&#xE44C;&#xE44D;&#xE44E;&#xE44F;&#xE450;&#xE451;&#xE452;&#xE453;&#xE454;&#xE455;&#xE456;&#xE457;&#xE458;&#xE459;&#xE45A;&#xE45B;&#xE45C;&#xE45D;&#xE45E;&#xE45F;&#xE460;&#xE461;&#xE462;&#xE463;&#xE464;&#xE465;&#xE466;&#xE467;67&quot;;
			map += &quot;&#xE468;&#xE469;&#xE46A;&#xE46B;&#xE46C;&#xE46D;&#xE46E;&#xE46F;&#xE470;&#xE471;&#xE472;&#xE473;&#xE474;&#xE475;&#xE476;&#xE477;&#xE478;&#xE479;&#xE47A;&#xE47B;&#xE47C;&#xE47D;&#xE47E;&#xE47F;&#xE480;&#xE481;&#xE482;&#xE483;&#xE484;&#xE485;&#xE486;&#xE487;&#xE488;&#xE489;&#xE48A;&#xE48B;&#xE48C;&#xE48D;&#xE48E;&#xE48F;&#xE490;&#xE491;&#xE492;&#xE493;&#xE494;&#xE495;&#xE496;&#xE497;&#xE498;&#xE499;&#xE49A;&#xE49B;&#xE49C;&#xE49D;&#xE49E;&#xE49F;&#xE4A0;&#xE4A1;&#xE4A2;&#xE4A3;&#xE4A4;&#xE4A5;&#xE4A6;1&#xE4A7;&#xE4A8;&#xE4A9;&#xE4AA;&#xE4AB;&#xE4AC;&#xE4AD;&#xE4AE;&#xE4AF;&#xE4B0;&#xE4B1;&#xE4B2;&#xE4B3;&#xE4B4;&#xE4B5;&#xE4B6;&#xE4B7;&#xE4B8;&#xE4B9;&#xE4BA;&#xE4BB;&#xE4BC;&#xE4BD;&#xE4BE;&#xE4BF;&#xE4C0;&#xE4C1;&#xE4C2;&#xE4C3;&#xE4C4;&#xE4C5;&#xE4C6;&#xE4C7;&#xE4C8;&#xE4C9;&#xE4CA;&#xE4CB;&#xE4CC;&#xE4CD;&#xE4CE;&#xE4CF;&#xE4D0;&#xE4D1;&#xE4D2;&#xE4D3;&#xE4D4;&#xE4D5;&#xE4D6;&#xE4D7;&#xE4D8;&#xE4D9;&#xE4DA;&#xE4DB;&#xE4DC;&#xE4DD;&#xE4DE;&#xE4DF;&#xE4E0;&#xE4E1;&#xE4E2;&#xE4E3;&#xE4E4;&#xE4E5;&#xE4E6;&#xE4E7;&#xE4E8;&#xE4E9;&#xE4EA;&#xE4EB;&#xE4EC;&#xE4ED;&#xE4EE;&#xE4EF;&#xE4F0;&#xE4F1;&#xE4F2;&#xE4F3;&#xE4F4;&#xE4F5;&#xE4F6;&#xE4F7;&#xE4F8;&#xE4F9;&#xE4FA;&#xE4FB;&#xE4FC;&#xE4FD;&#xE4FE;&#xE4FF;&#xE500;&#xE501;&#xE502;&#xE503;&#xE504;&#xE505;&#xE506;&#xE507;&#xE508;&#xE509;&#xE50A;&#xE50B;&#xE50C;&#xE50D;&#xE50E;&#xE50F;&#xE510;&#xE511;&#xE512;&#xE513;&#xE514;&#xE515;&#xE516;&#xE517;&#xE518;&#xE519;&#xE51A;&#xE51B;&#xE51C;&#xE51D;&#xE51E;&#xE51F;&#xE520;&#xE521;&#xE522;&#xE523;67&quot;;
			map += &quot;&#xE524;&#xE525;&#xE526;&#xE527;&#xE528;&#xE529;&#xE52A;&#xE52B;&#xE52C;&#xE52D;&#xE52E;&#xE52F;&#xE530;&#xE531;&#xE532;&#xE533;&#xE534;&#xE535;&#xE536;&#xE537;&#xE538;&#xE539;&#xE53A;&#xE53B;&#xE53C;&#xE53D;&#xE53E;&#xE53F;&#xE540;&#xE541;&#xE542;&#xE543;&#xE544;&#xE545;&#xE546;&#xE547;&#xE548;&#xE549;&#xE54A;&#xE54B;&#xE54C;&#xE54D;&#xE54E;&#xE54F;&#xE550;&#xE551;&#xE552;&#xE553;&#xE554;&#xE555;&#xE556;&#xE557;&#xE558;&#xE559;&#xE55A;&#xE55B;&#xE55C;&#xE55D;&#xE55E;&#xE55F;&#xE560;&#xE561;&#xE562;1&#xE563;&#xE564;&#xE565;&#xE566;&#xE567;&#xE568;&#xE569;&#xE56A;&#xE56B;&#xE56C;&#xE56D;&#xE56E;&#xE56F;&#xE570;&#xE571;&#xE572;&#xE573;&#xE574;&#xE575;&#xE576;&#xE577;&#xE578;&#xE579;&#xE57A;&#xE57B;&#xE57C;&#xE57D;&#xE57E;&#xE57F;&#xE580;&#xE581;&#xE582;&#xE583;&#xE584;&#xE585;&#xE586;&#xE587;&#xE588;&#xE589;&#xE58A;&#xE58B;&#xE58C;&#xE58D;&#xE58E;&#xE58F;&#xE590;&#xE591;&#xE592;&#xE593;&#xE594;&#xE595;&#xE596;&#xE597;&#xE598;&#xE599;&#xE59A;&#xE59B;&#xE59C;&#xE59D;&#xE59E;&#xE59F;&#xE5A0;&#xE5A1;&#xE5A2;&#xE5A3;&#xE5A4;&#xE5A5;&#xE5A6;&#xE5A7;&#xE5A8;&#xE5A9;&#xE5AA;&#xE5AB;&#xE5AC;&#xE5AD;&#xE5AE;&#xE5AF;&#xE5B0;&#xE5B1;&#xE5B2;&#xE5B3;&#xE5B4;&#xE5B5;&#xE5B6;&#xE5B7;&#xE5B8;&#xE5B9;&#xE5BA;&#xE5BB;&#xE5BC;&#xE5BD;&#xE5BE;&#xE5BF;&#xE5C0;&#xE5C1;&#xE5C2;&#xE5C3;&#xE5C4;&#xE5C5;&#xE5C6;&#xE5C7;&#xE5C8;&#xE5C9;&#xE5CA;&#xE5CB;&#xE5CC;&#xE5CD;&#xE5CE;&#xE5CF;&#xE5D0;&#xE5D1;&#xE5D2;&#xE5D3;&#xE5D4;&#xE5D5;&#xE5D6;&#xE5D7;&#xE5D8;&#xE5D9;&#xE5DA;&#xE5DB;&#xE5DC;&#xE5DD;&#xE5DE;&#xE5DF;67&quot;;
			map += &quot;&#xE5E0;&#xE5E1;&#xE5E2;&#xE5E3;&#xE5E4;&#xE5E5;&#xE5E6;&#xE5E7;&#xE5E8;&#xE5E9;&#xE5EA;&#xE5EB;&#xE5EC;&#xE5ED;&#xE5EE;&#xE5EF;&#xE5F0;&#xE5F1;&#xE5F2;&#xE5F3;&#xE5F4;&#xE5F5;&#xE5F6;&#xE5F7;&#xE5F8;&#xE5F9;&#xE5FA;&#xE5FB;&#xE5FC;&#xE5FD;&#xE5FE;&#xE5FF;&#xE600;&#xE601;&#xE602;&#xE603;&#xE604;&#xE605;&#xE606;&#xE607;&#xE608;&#xE609;&#xE60A;&#xE60B;&#xE60C;&#xE60D;&#xE60E;&#xE60F;&#xE610;&#xE611;&#xE612;&#xE613;&#xE614;&#xE615;&#xE616;&#xE617;&#xE618;&#xE619;&#xE61A;&#xE61B;&#xE61C;&#xE61D;&#xE61E;1&#xE61F;&#xE620;&#xE621;&#xE622;&#xE623;&#xE624;&#xE625;&#xE626;&#xE627;&#xE628;&#xE629;&#xE62A;&#xE62B;&#xE62C;&#xE62D;&#xE62E;&#xE62F;&#xE630;&#xE631;&#xE632;&#xE633;&#xE634;&#xE635;&#xE636;&#xE637;&#xE638;&#xE639;&#xE63A;&#xE63B;&#xE63C;&#xE63D;&#xE63E;&#xE63F;&#xE640;&#xE641;&#xE642;&#xE643;&#xE644;&#xE645;&#xE646;&#xE647;&#xE648;&#xE649;&#xE64A;&#xE64B;&#xE64C;&#xE64D;&#xE64E;&#xE64F;&#xE650;&#xE651;&#xE652;&#xE653;&#xE654;&#xE655;&#xE656;&#xE657;&#xE658;&#xE659;&#xE65A;&#xE65B;&#xE65C;&#xE65D;&#xE65E;&#xE65F;&#xE660;&#xE661;&#xE662;&#xE663;&#xE664;&#xE665;&#xE666;&#xE667;&#xE668;&#xE669;&#xE66A;&#xE66B;&#xE66C;&#xE66D;&#xE66E;&#xE66F;&#xE670;&#xE671;&#xE672;&#xE673;&#xE674;&#xE675;&#xE676;&#xE677;&#xE678;&#xE679;&#xE67A;&#xE67B;&#xE67C;&#xE67D;&#xE67E;&#xE67F;&#xE680;&#xE681;&#xE682;&#xE683;&#xE684;&#xE685;&#xE686;&#xE687;&#xE688;&#xE689;&#xE68A;&#xE68B;&#xE68C;&#xE68D;&#xE68E;&#xE68F;&#xE690;&#xE691;&#xE692;&#xE693;&#xE694;&#xE695;&#xE696;&#xE697;&#xE698;&#xE699;&#xE69A;&#xE69B;67&quot;;
			map += &quot;&#xE69C;&#xE69D;&#xE69E;&#xE69F;&#xE6A0;&#xE6A1;&#xE6A2;&#xE6A3;&#xE6A4;&#xE6A5;&#xE6A6;&#xE6A7;&#xE6A8;&#xE6A9;&#xE6AA;&#xE6AB;&#xE6AC;&#xE6AD;&#xE6AE;&#xE6AF;&#xE6B0;&#xE6B1;&#xE6B2;&#xE6B3;&#xE6B4;&#xE6B5;&#xE6B6;&#xE6B7;&#xE6B8;&#xE6B9;&#xE6BA;&#xE6BB;&#xE6BC;&#xE6BD;&#xE6BE;&#xE6BF;&#xE6C0;&#xE6C1;&#xE6C2;&#xE6C3;&#xE6C4;&#xE6C5;&#xE6C6;&#xE6C7;&#xE6C8;&#xE6C9;&#xE6CA;&#xE6CB;&#xE6CC;&#xE6CD;&#xE6CE;&#xE6CF;&#xE6D0;&#xE6D1;&#xE6D2;&#xE6D3;&#xE6D4;&#xE6D5;&#xE6D6;&#xE6D7;&#xE6D8;&#xE6D9;&#xE6DA;1&#xE6DB;&#xE6DC;&#xE6DD;&#xE6DE;&#xE6DF;&#xE6E0;&#xE6E1;&#xE6E2;&#xE6E3;&#xE6E4;&#xE6E5;&#xE6E6;&#xE6E7;&#xE6E8;&#xE6E9;&#xE6EA;&#xE6EB;&#xE6EC;&#xE6ED;&#xE6EE;&#xE6EF;&#xE6F0;&#xE6F1;&#xE6F2;&#xE6F3;&#xE6F4;&#xE6F5;&#xE6F6;&#xE6F7;&#xE6F8;&#xE6F9;&#xE6FA;&#xE6FB;&#xE6FC;&#xE6FD;&#xE6FE;&#xE6FF;&#xE700;&#xE701;&#xE702;&#xE703;&#xE704;&#xE705;&#xE706;&#xE707;&#xE708;&#xE709;&#xE70A;&#xE70B;&#xE70C;&#xE70D;&#xE70E;&#xE70F;&#xE710;&#xE711;&#xE712;&#xE713;&#xE714;&#xE715;&#xE716;&#xE717;&#xE718;&#xE719;&#xE71A;&#xE71B;&#xE71C;&#xE71D;&#xE71E;&#xE71F;&#xE720;&#xE721;&#xE722;&#xE723;&#xE724;&#xE725;&#xE726;&#xE727;&#xE728;&#xE729;&#xE72A;&#xE72B;&#xE72C;&#xE72D;&#xE72E;&#xE72F;&#xE730;&#xE731;&#xE732;&#xE733;&#xE734;&#xE735;&#xE736;&#xE737;&#xE738;&#xE739;&#xE73A;&#xE73B;&#xE73C;&#xE73D;&#xE73E;&#xE73F;&#xE740;&#xE741;&#xE742;&#xE743;&#xE744;&#xE745;&#xE746;&#xE747;&#xE748;&#xE749;&#xE74A;&#xE74B;&#xE74C;&#xE74D;&#xE74E;&#xE74F;&#xE750;&#xE751;&#xE752;&#xE753;&#xE754;&#xE755;&#xE756;&#xE757;67&quot;;
			map += &quot;&#x2170;&#x2171;&#x2172;&#x2173;&#x2174;&#x2175;&#x2176;&#x2177;&#x2178;&#x2179;&#x2160;&#x2161;&#x2162;&#x2163;&#x2164;&#x2165;&#x2166;&#x2167;&#x2168;&#x2169;&#xFFE2;&#xFFE4;&#xFF07;&#xFF02;&#x3231;&#x2116;&#x2121;&#x2235;&#x7E8A;&#x891C;&#x9348;&#x9288;&#x84DC;&#x4FC9;&#x70BB;&#x6631;&#x68C8;&#x92F9;&#x66FB;&#x5F45;&#x4E28;&#x4EE1;&#x4EFC;&#x4F00;&#x4F03;&#x4F39;&#x4F56;&#x4F92;&#x4F8A;&#x4F9A;&#x4F94;&#x4FCD;&#x5040;&#x5022;&#x4FFF;&#x501E;&#x5046;&#x5070;&#x5042;&#x5094;&#x50F4;&#x50D8;&#x514A;1&#x5164;&#x519D;&#x51BE;&#x51EC;&#x5215;&#x529C;&#x52A6;&#x52C0;&#x52DB;&#x5300;&#x5307;&#x5324;&#x5372;&#x5393;&#x53B2;&#x53DD;&#xFA0E;&#x549C;&#x548A;&#x54A9;&#x54FF;&#x5586;&#x5759;&#x5765;&#x57AC;&#x57C8;&#x57C7;&#xFA0F;&#xFA10;&#x589E;&#x58B2;&#x590B;&#x5953;&#x595B;&#x595D;&#x5963;&#x59A4;&#x59BA;&#x5B56;&#x5BC0;&#x752F;&#x5BD8;&#x5BEC;&#x5C1E;&#x5CA6;&#x5CBA;&#x5CF5;&#x5D27;&#x5D53;&#xFA11;&#x5D42;&#x5D6D;&#x5DB8;&#x5DB9;&#x5DD0;&#x5F21;&#x5F34;&#x5F67;&#x5FB7;&#x5FDE;&#x605D;&#x6085;&#x608A;&#x60DE;&#x60D5;&#x6120;&#x60F2;&#x6111;&#x6137;&#x6130;&#x6198;&#x6213;&#x62A6;&#x63F5;&#x6460;&#x649D;&#x64CE;&#x654E;&#x6600;&#x6615;&#x663B;&#x6609;&#x662E;&#x661E;&#x6624;&#x6665;&#x6657;&#x6659;&#xFA12;&#x6673;&#x6699;&#x66A0;&#x66B2;&#x66BF;&#x66FA;&#x670E;&#xF929;&#x6766;&#x67BB;&#x6852;&#x67C0;&#x6801;&#x6844;&#x68CF;&#xFA13;&#x6968;&#xFA14;&#x6998;&#x69E2;&#x6A30;&#x6A6B;&#x6A46;&#x6A73;&#x6A7E;&#x6AE2;&#x6AE4;&#x6BD6;&#x6C3F;&#x6C5C;&#x6C86;&#x6C6F;&#x6CDA;&#x6D04;&#x6D87;&#x6D6F;67&quot;;
			map += &quot;&#x6D96;&#x6DAC;&#x6DCF;&#x6DF8;&#x6DF2;&#x6DFC;&#x6E39;&#x6E5C;&#x6E27;&#x6E3C;&#x6EBF;&#x6F88;&#x6FB5;&#x6FF5;&#x7005;&#x7007;&#x7028;&#x7085;&#x70AB;&#x710F;&#x7104;&#x715C;&#x7146;&#x7147;&#xFA15;&#x71C1;&#x71FE;&#x72B1;&#x72BE;&#x7324;&#xFA16;&#x7377;&#x73BD;&#x73C9;&#x73D6;&#x73E3;&#x73D2;&#x7407;&#x73F5;&#x7426;&#x742A;&#x7429;&#x742E;&#x7462;&#x7489;&#x749F;&#x7501;&#x756F;&#x7682;&#x769C;&#x769E;&#x769B;&#x76A6;&#xFA17;&#x7746;&#x52AF;&#x7821;&#x784E;&#x7864;&#x787A;&#x7930;&#xFA18;&#xFA19;1&#xFA1A;&#x7994;&#xFA1B;&#x799B;&#x7AD1;&#x7AE7;&#xFA1C;&#x7AEB;&#x7B9E;&#xFA1D;&#x7D48;&#x7D5C;&#x7DB7;&#x7DA0;&#x7DD6;&#x7E52;&#x7F47;&#x7FA1;&#xFA1E;&#x8301;&#x8362;&#x837F;&#x83C7;&#x83F6;&#x8448;&#x84B4;&#x8553;&#x8559;&#x856B;&#xFA1F;&#x85B0;&#xFA20;&#xFA21;&#x8807;&#x88F5;&#x8A12;&#x8A37;&#x8A79;&#x8AA7;&#x8ABE;&#x8ADF;&#xFA22;&#x8AF6;&#x8B53;&#x8B7F;&#x8CF0;&#x8CF4;&#x8D12;&#x8D76;&#xFA23;&#x8ECF;&#xFA24;&#xFA25;&#x9067;&#x90DE;&#xFA26;&#x9115;&#x9127;&#x91DA;&#x91D7;&#x91DE;&#x91ED;&#x91EE;&#x91E4;&#x91E5;&#x9206;&#x9210;&#x920A;&#x923A;&#x9240;&#x923C;&#x924E;&#x9259;&#x9251;&#x9239;&#x9267;&#x92A7;&#x9277;&#x9278;&#x92E7;&#x92D7;&#x92D9;&#x92D0;&#xFA27;&#x92D5;&#x92E0;&#x92D3;&#x9325;&#x9321;&#x92FB;&#xFA28;&#x931E;&#x92FF;&#x931D;&#x9302;&#x9370;&#x9357;&#x93A4;&#x93C6;&#x93DE;&#x93F8;&#x9431;&#x9445;&#x9448;&#x9592;&#xF9DC;&#xFA29;&#x969D;&#x96AF;&#x9733;&#x973B;&#x9743;&#x974D;&#x974F;&#x9751;&#x9755;&#x9857;&#x9865;&#xFA2A;&#xFA2B;&#x9927;&#xFA2C;&#x999E;&#x9A4E;&#x9AD9;67&quot;;
			map += &quot;&#x9ADC;&#x9B75;&#x9B72;&#x9B8F;&#x9BB1;&#x9BBB;&#x9C00;&#x9D70;&#x9D6B;&#xFA2D;&#x9E19;&#x9ED1;&quot;;

			/*
			&#x4E0A;&#x306E;&#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x4F5C;&#x6210;&#x7528;&#x306E;&#x6587;&#x5B57;&#x5217;&#x306F;&#x6570;&#x5024;&#x304C;&#x5165;&#x3063;&#x305F;&#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x304B;&#x3089;&#x4F5C;&#x6210;&#x3057;&#x3066;&#x3044;&#x308B;
			let output = &quot;&quot;;
			let nul_count = 0;
			for(i = 0x8140; i &lt;= 0xffff; i++) {
				if(map[i]) {
					if(nul_count !== 0){
						output += nul_count;
						nul_count = 0;
					}
					output += MojiJS.fromCodePoint(map[i]);
				}
				else {
					nul_count++;
				}
			}
			*/

			/**
			 * UTF16&#x3078;&#x5909;&#x63DB;
			 */
			const utf16_array = Unicode.toUTF16Array(map);

			// &#x30DE;&#x30C3;&#x30D7;&#x5C55;&#x958B;
			let is_num = false;
			let num_array = [];
			let key = 0x8140;
			for(let i = 0; i &lt; utf16_array.length; i++) {
				const x = utf16_array[i];
				if((0x30 &lt;= x) &amp;&amp; (x &lt;= 0x39)) {
					if(!is_num) {
						is_num = true;
						num_array = [];
					}
					num_array.push(x);
				}
				else {
					if(is_num) {
						key += parseFloat(Unicode.fromUTF16Array(num_array));
						is_num = false;
					}
					cp932_to_unicode_map[key] = x;
					key++;
				}
			}

			return cp932_to_unicode_map;
		};

		/**
		 * CP932 &#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;
		 * @type {Object&lt;number, number&gt;}
		 */
		const cp932_to_unicode_map = getCp932ToUnicodeMap();

		/**
		 * &#x91CD;&#x8907;&#x3055;&#x308C;&#x305F; CP932 &#x306E;&#x30B3;&#x30FC;&#x30C9;
		 * @type {Array&lt;number&gt;}
		 */
		const duplicate_map_array = [
			0x8790, 0x8791, 0x8792, 0x8795, 0x8796, 0x8797, 0x879a, 0x879b, 0x879c, 0xed40, 0xed41, 0xed42, 0xed43, 0xed44, 0xed45, 0xed46,
			0xed47, 0xed48, 0xed49, 0xed4a, 0xed4b, 0xed4c, 0xed4d, 0xed4e, 0xed4f, 0xed50, 0xed51, 0xed52, 0xed53, 0xed54, 0xed55, 0xed56,
			0xed57, 0xed58, 0xed59, 0xed5a, 0xed5b, 0xed5c, 0xed5d, 0xed5e, 0xed5f, 0xed60, 0xed61, 0xed62, 0xed63, 0xed64, 0xed65, 0xed66,
			0xed67, 0xed68, 0xed69, 0xed6a, 0xed6b, 0xed6c, 0xed6d, 0xed6e, 0xed6f, 0xed70, 0xed71, 0xed72, 0xed73, 0xed74, 0xed75, 0xed76,
			0xed77, 0xed78, 0xed79, 0xed7a, 0xed7b, 0xed7c, 0xed7d, 0xed7e, 0xed80, 0xed81, 0xed82, 0xed83, 0xed84, 0xed85, 0xed86, 0xed87,
			0xed88, 0xed89, 0xed8a, 0xed8b, 0xed8c, 0xed8d, 0xed8e, 0xed8f, 0xed90, 0xed91, 0xed92, 0xed93, 0xed94, 0xed95, 0xed96, 0xed97,
			0xed98, 0xed99, 0xed9a, 0xed9b, 0xed9c, 0xed9d, 0xed9e, 0xed9f, 0xeda0, 0xeda1, 0xeda2, 0xeda3, 0xeda4, 0xeda5, 0xeda6, 0xeda7,
			0xeda8, 0xeda9, 0xedaa, 0xedab, 0xedac, 0xedad, 0xedae, 0xedaf, 0xedb0, 0xedb1, 0xedb2, 0xedb3, 0xedb4, 0xedb5, 0xedb6, 0xedb7,
			0xedb8, 0xedb9, 0xedba, 0xedbb, 0xedbc, 0xedbd, 0xedbe, 0xedbf, 0xedc0, 0xedc1, 0xedc2, 0xedc3, 0xedc4, 0xedc5, 0xedc6, 0xedc7,
			0xedc8, 0xedc9, 0xedca, 0xedcb, 0xedcc, 0xedcd, 0xedce, 0xedcf, 0xedd0, 0xedd1, 0xedd2, 0xedd3, 0xedd4, 0xedd5, 0xedd6, 0xedd7,
			0xedd8, 0xedd9, 0xedda, 0xeddb, 0xeddc, 0xeddd, 0xedde, 0xeddf, 0xede0, 0xede1, 0xede2, 0xede3, 0xede4, 0xede5, 0xede6, 0xede7,
			0xede8, 0xede9, 0xedea, 0xedeb, 0xedec, 0xeded, 0xedee, 0xedef, 0xedf0, 0xedf1, 0xedf2, 0xedf3, 0xedf4, 0xedf5, 0xedf6, 0xedf7,
			0xedf8, 0xedf9, 0xedfa, 0xedfb, 0xedfc, 0xee40, 0xee41, 0xee42, 0xee43, 0xee44, 0xee45, 0xee46, 0xee47, 0xee48, 0xee49, 0xee4a,
			0xee4b, 0xee4c, 0xee4d, 0xee4e, 0xee4f, 0xee50, 0xee51, 0xee52, 0xee53, 0xee54, 0xee55, 0xee56, 0xee57, 0xee58, 0xee59, 0xee5a,
			0xee5b, 0xee5c, 0xee5d, 0xee5e, 0xee5f, 0xee60, 0xee61, 0xee62, 0xee63, 0xee64, 0xee65, 0xee66, 0xee67, 0xee68, 0xee69, 0xee6a,
			0xee6b, 0xee6c, 0xee6d, 0xee6e, 0xee6f, 0xee70, 0xee71, 0xee72, 0xee73, 0xee74, 0xee75, 0xee76, 0xee77, 0xee78, 0xee79, 0xee7a,
			0xee7b, 0xee7c, 0xee7d, 0xee7e, 0xee80, 0xee81, 0xee82, 0xee83, 0xee84, 0xee85, 0xee86, 0xee87, 0xee88, 0xee89, 0xee8a, 0xee8b,
			0xee8c, 0xee8d, 0xee8e, 0xee8f, 0xee90, 0xee91, 0xee92, 0xee93, 0xee94, 0xee95, 0xee96, 0xee97, 0xee98, 0xee99, 0xee9a, 0xee9b,
			0xee9c, 0xee9d, 0xee9e, 0xee9f, 0xeea0, 0xeea1, 0xeea2, 0xeea3, 0xeea4, 0xeea5, 0xeea6, 0xeea7, 0xeea8, 0xeea9, 0xeeaa, 0xeeab,
			0xeeac, 0xeead, 0xeeae, 0xeeaf, 0xeeb0, 0xeeb1, 0xeeb2, 0xeeb3, 0xeeb4, 0xeeb5, 0xeeb6, 0xeeb7, 0xeeb8, 0xeeb9, 0xeeba, 0xeebb,
			0xeebc, 0xeebd, 0xeebe, 0xeebf, 0xeec0, 0xeec1, 0xeec2, 0xeec3, 0xeec4, 0xeec5, 0xeec6, 0xeec7, 0xeec8, 0xeec9, 0xeeca, 0xeecb,
			0xeecc, 0xeecd, 0xeece, 0xeecf, 0xeed0, 0xeed1, 0xeed2, 0xeed3, 0xeed4, 0xeed5, 0xeed6, 0xeed7, 0xeed8, 0xeed9, 0xeeda, 0xeedb,
			0xeedc, 0xeedd, 0xeede, 0xeedf, 0xeee0, 0xeee1, 0xeee2, 0xeee3, 0xeee4, 0xeee5, 0xeee6, 0xeee7, 0xeee8, 0xeee9, 0xeeea, 0xeeeb,
			0xeeec, 0xeeef, 0xeef0, 0xeef1, 0xeef2, 0xeef3, 0xeef4, 0xeef5, 0xeef6, 0xeef7, 0xeef8, 0xeef9, 0xeefa, 0xeefb, 0xeefc, 0xfa4a,
			0xfa4b, 0xfa4c, 0xfa4d, 0xfa4e, 0xfa4f, 0xfa50, 0xfa51, 0xfa52, 0xfa53, 0xfa54, 0xfa58, 0xfa59, 0xfa5a, 0xfa5b
		];

		/**
		 * @type {Object&lt;number, number&gt;}
		 */
		const duplicate_map = {};
		
		/**
		 * @type {Object&lt;number, number&gt;}
		 */
		const unicode_to_cp932_map = {};

		for(const key in duplicate_map_array) {
			duplicate_map[duplicate_map_array[key]] = 1;
		}
		for(const key in cp932_to_unicode_map) {
			// &#x91CD;&#x8907;&#x767B;&#x9332;&#x3055;&#x308C;&#x305F;&#x6587;&#x5B57;
			// IBM&#x62E1;&#x5F35;&#x6587;&#x5B57; &#x3068; NEC&#x7279;&#x6B8A;&#x6587;&#x5B57; &#x3068; NEC&#x9078;&#x5B9A;IBM&#x62E1;&#x5F35;&#x6587;&#x5B57; &#x3067;
			// &#x30DE;&#x30C3;&#x30D4;&#x30F3;&#x30B0;&#x5148;&#x304C;&#x4E00;&#x90E8;&#x91CD;&#x8907;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;
			// WideCharToMultiByte &#x306E;&#x4ED5;&#x69D8;&#x306B;&#x57FA;&#x3065;&#x304D;&#x3001;&#x767B;&#x9332;&#x3057;&#x306A;&#x3044;&#x3002;
			if(duplicate_map[key]) {
				continue;
			}
			const x = cp932_to_unicode_map[key];
			unicode_to_cp932_map[x] = parseInt(key, 10);
		}

		// &#x9006;&#x5F15;&#x304D;&#x306E;&#x6CE8;&#x610F;&#x70B9;

		// &#x534A;&#x89D2;&#xFFE5;&#x30DE;&#x30FC;&#x30AF;&#x554F;&#x984C;
		// &#x534A;&#x89D2;&#xFFE5;&#x30DE;&#x30FC;&#x30AF;&#x306F;&#x3001;Shift_JIS&#x306E;&#x300C;5c 0xReverse Solidus &#x9006;&#x659C;&#x7DDA;&#x300D;&#x306B;&#x3059;&#x308B;
		// Unicode &apos;&#xA5;&apos; 0x00a5 Yen Sign &#x534A;&#x89D2;&#x5186;&#x30DE;&#x30FC;&#x30AF;
		unicode_to_cp932_map[0xa5] = 0x5c;

		// &#x6CE2;&#x7DDA;&#x554F;&#x984C;
		// SJIS2004&#x4E0A;&#x306F; 0x8160 &#x3068; 0x81B0 &#x3068;&#x3067;&#x533A;&#x5225;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
		// Shift_JIS&#x306F; 0x301c &#x3092; 0x8160 &#x306B;&#x7D71;&#x4E00;
		// Unicode &apos;&#x301C;&apos; 0x301c Shift_JIS-2004 0x8160 Wave Dash &#x6CE2;&#x30C0;&#x30C3;&#x30B7;&#x30E5;
		// Unicode &apos;&#xFF5E;&apos; 0xff5e Shift_JIS-2004 0x81B0 Fullwidth Tilde &#x5168;&#x89D2;&#x30C1;&#x30EB;&#x30C0;
		unicode_to_cp932_map[0x301c] = 0x8160;

		// &#x30DE;&#x30A4;&#x30CA;&#x30B9;&#x554F;&#x984C;
		// SJIS2004&#x4E0A;&#x306F; 0x817c &#x3068; 0x81af &#x3068;&#x3067;&#x533A;&#x5225;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;
		// Shift_JIS&#x306F;&#x3001;0x2212 &#x3092;&#x5168;&#x89D2;&#x8CA0;&#x8A18;&#x53F7; 0x817c &#x3078;&#x5909;&#x66F4;
		// Unicode `&#x2212;` 0x2212 Shift_JIS-2004 0x817c &#x8CA0;&#x7B26;&#x53F7;/&#x6E1B;&#x7B97;&#x8A18;&#x53F7;
		// Unicode `&#xFF0D;` 0xff0d Shift_JIS-2004 0x81af &#x30CF;&#x30A4;&#x30D5;&#x30F3;&#x30DE;&#x30A4;&#x30CA;&#x30B9;
		unicode_to_cp932_map[0x2212] = 0x817c;

		CP932MAP.cp932_to_unicode_map = cp932_to_unicode_map;
		CP932MAP.unicode_to_cp932_map = unicode_to_cp932_map;
	}

	/**
	 * @returns {Object&lt;number, number&gt;}
	 */
	static CP932_TO_UNICODE() {
		CP932MAP.init();
		return CP932MAP.cp932_to_unicode_map;
	}
	
	/**
	 * @returns {Object&lt;number, number&gt;}
	 */
	static UNICODE_TO_CP932() {
		CP932MAP.init();
		return CP932MAP.unicode_to_cp932_map;
	}
}

/**
 * &#x5909;&#x63DB;&#x30DE;&#x30C3;&#x30D7;&#x3092;&#x521D;&#x671F;&#x5316;&#x3057;&#x305F;&#x304B;&#x3069;&#x3046;&#x304B;
 * @type {boolean}
 */
CP932MAP.is_initmap = false;

/**
 * &#x5909;&#x63DB;&#x7528;&#x30DE;&#x30C3;&#x30D7;
 * @type {Object&lt;number, number&gt;}
 */
CP932MAP.cp932_to_unicode_map = null;

/**
 * &#x5909;&#x63DB;&#x7528;&#x30DE;&#x30C3;&#x30D7;
 * @type {Object&lt;number, number&gt;}
 */
CP932MAP.unicode_to_cp932_map = null;

/**
 * CP932, Windows-31J &#x3092;&#x6271;&#x3046;&#x30AF;&#x30E9;&#x30B9;
 * @ignore
 */
export default class CP932 {

	/**
	 * Unicode &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x304B;&#x3089; CP932 &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x5909;&#x63DB;
	 * @param {Number} unicode_codepoint - Unicode &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8;
	 * @returns {Number} CP932 &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8; (&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F; undefined)
	 */
	static toCP932FromUnicode(unicode_codepoint) {
		return CP932MAP.UNICODE_TO_CP932()[unicode_codepoint];
	}

	/**
	 * CP932 &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x304B;&#x3089; Unicode &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x5909;&#x63DB;
	 * @param {Number} cp932_codepoint - CP932 &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8;
	 * @returns {Number} Unicode &#x306E;&#x30B3;&#x30FC;&#x30C9;&#x30DD;&#x30A4;&#x30F3;&#x30C8; (&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F; undefined)
	 */
	static toUnicodeFromCP932(cp932_codepoint) {
		return CP932MAP.CP932_TO_UNICODE()[cp932_codepoint];
	}
	
	/**
	 * &#x6587;&#x5B57;&#x5217;&#x3092; CP932 &#x306E;&#x914D;&#x5217;&#x306B;&#x5909;&#x63DB;
	 * @param {String} text - &#x5909;&#x63DB;&#x3057;&#x305F;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 * @returns {Array&lt;number&gt;} CP932 &#x306E;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x5165;&#x3063;&#x305F;&#x914D;&#x5217;
	 */
	static toCP932Array(text) {
		return SJIS.toSJISArray(text, CP932MAP.UNICODE_TO_CP932());
	}

	/**
	 * &#x6587;&#x5B57;&#x5217;&#x3092; CP932 &#x306E;&#x30D0;&#x30A4;&#x30CA;&#x30EA;&#x914D;&#x5217;&#x306B;&#x5909;&#x63DB;
	 * - &#x65E5;&#x672C;&#x8A9E;&#x6587;&#x5B57;&#x306F;2&#x30D0;&#x30A4;&#x30C8;&#x3068;&#x3057;&#x3066;&#x3001;&#x914D;&#x5217;&#x3082;2&#x3064;&#x5206;&#x3001;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;
	 * @param {String} text - &#x5909;&#x63DB;&#x3057;&#x305F;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 * @returns {Array&lt;number&gt;} CP932 &#x306E;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x5165;&#x3063;&#x305F;&#x30D0;&#x30A4;&#x30CA;&#x30EA;&#x914D;&#x5217;
	 */
	static toCP932Binary(text) {
		return SJIS.toSJISBinary(text, CP932MAP.UNICODE_TO_CP932());
	}

	/**
	 * CP932 &#x306E;&#x914D;&#x5217;&#x304B;&#x3089;&#x6587;&#x5B57;&#x5217;&#x306B;&#x5909;&#x63DB;
	 * @param {Array&lt;number&gt;} cp932 - &#x5909;&#x63DB;&#x3057;&#x305F;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 * @returns {String} &#x5909;&#x63DB;&#x5F8C;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 */
	static fromCP932Array(cp932) {
		return SJIS.fromSJISArray(cp932, CP932MAP.CP932_TO_UNICODE());
	}

	/**
	 * &#x6307;&#x5B9A;&#x3057;&#x305F;&#x6587;&#x5B57;&#x304B;&#x3089; Windows-31J &#x4E0A;&#x306E;&#x533A;&#x70B9;&#x756A;&#x53F7;&#x306B;&#x5909;&#x63DB;
	 * - 2&#x6587;&#x5B57;&#x4EE5;&#x4E0A;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;1&#x6587;&#x5B57;&#x76EE;&#x306E;&#x307F;&#x3092;&#x5909;&#x63DB;&#x3059;&#x308B;
	 * @param {String} text - &#x5909;&#x63DB;&#x3057;&#x305F;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 * @returns {import(&quot;./SJIS.js&quot;).MenKuTen} &#x533A;&#x70B9;&#x756A;&#x53F7;(&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#xFF08;1&#x30D0;&#x30A4;&#x30C8;&#x306E;JIS&#x30B3;&#x30FC;&#x30C9;&#x306A;&#x3069;&#xFF09;&#x306F;null&#x3092;&#x8FD4;&#x3059;)
	 */
	static toKuTen(text) {
		if(text.length === 0) {
			return null;
		}
		const cp932_code = CP932.toCP932FromUnicode(Unicode.toUTF32Array(text)[0]);
		return cp932_code ? SJIS.toKuTenFromSJISCode(cp932_code) : null;
	}
	
	/**
	 * Windows-31J &#x4E0A;&#x306E;&#x533A;&#x70B9;&#x756A;&#x53F7;&#x304B;&#x3089;&#x6587;&#x5B57;&#x5217;&#x306B;&#x5909;&#x63DB;
	 * @param {import(&quot;./SJIS.js&quot;).MenKuTen|string} kuten - &#x533A;&#x70B9;&#x756A;&#x53F7;
	 * @returns {String} &#x5909;&#x63DB;&#x5F8C;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;
	 */
	static fromKuTen(kuten) {
		const code = SJIS.toUnicodeCodeFromKuTen(kuten, CP932MAP.CP932_TO_UNICODE());
		return code ? Unicode.fromUTF32Array(code) : &quot;&quot;;
	}

}
</code></pre>

</div>

<footer class="footer">
  Generated by <a href="https://esdoc.org">ESDoc<span data-ice="esdocVersion">(1.1.0)</span><img src="./image/esdoc-logo-mini-black.png"></a>
</footer>

<script src="script/search_index.js"></script>
<script src="script/search.js"></script>
<script src="script/pretty-print.js"></script>
<script src="script/inherited-summary.js"></script>
<script src="script/test-summary.js"></script>
<script src="script/inner-link.js"></script>
<script src="script/patch-for-local.js"></script>
</body>
</html>
